{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "s1103-115",
         "bill_slug": "s1103",
         "congress": "115",
         "bill": "S.1103",
         "bill_type": "s",
         "number": "S.1103",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/s1103.json",
         "title": "Department of Homeland Security Blue Campaign Authorization Act of 2017",
         "short_title": "Department of Homeland Security Blue Campaign Authorization Act of 2017",
         "sponsor_title": "Sen.",
         "sponsor": "Ron Johnson",
         "sponsor_id": "J000293",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/J000293.json",
         "sponsor_party": "R",
         "sponsor_state": "WI",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115s1103is/pdf/BILLS-115s1103is.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/senate-bill/1103",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/s1103",
         "introduced_date": "2017-05-11",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 1,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Emergency Management",
         "committees": "Senate Homeland Security and Governmental Affairs Committee",
         "committee_codes": ["SSGA"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-09-14",
         "latest_major_action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 221.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "Department of Homeland Security Blue Campaign Authorization Act of 2017 This bill amends the Homeland Security Act of 2002 to establish within the Department of Homeland Security (DHS) the Blue Campaign to unify and coordinate DHS efforts to address human trafficking. The campaign shall provide guidance and training to appropriate DHS personnel and other law enforcement personnel regarding:  programs to help identify instances of human trafficking; the types of information that should be collected and recorded in information technology systems utilized by DHS to help identify individuals suspected or convicted of human trafficking; systematic and routine information sharing within DHS and among law enforcement agencies regarding such individuals and patterns and practices of human trafficking; techniques to identify suspected trafficking victims along the U.S. border and at airport security checkpoints; methods to be used to train Transportation Security Administration employees to identify trafficking victims and to serve as a liaison and resource regarding trafficking prevention to appropriate state, local, and private sector aviation workers and the traveling public; utilizing resources to educate partners and stakeholders and to increase public awareness of human trafficking; and leveraging partnerships with governmental, nongovernmental, and private organizations to raise such awareness.  DHS shall: (1) ensure the integration of information technology systems utilized within DHS to record and track information regarding individuals suspected or convicted of human trafficking; and (2) report to Congress describing the status and effectiveness of, and providing recommendation regarding the appropriate DHS office for, such campaign.",
         "summary_short": "Department of Homeland Security Blue Campaign Authorization Act of 2017 This bill amends the Homeland Security Act of 2002 to establish within the Department of Homeland Security (DHS) the Blue Campaign to unify and coordinate DHS efforts to address human trafficking. The campaign shall provide guidance and training to appropriate DHS personnel and other law enforcement personnel regarding:  programs to help identify instances of human trafficking; the types of information that should be coll...",
         "versions":[
],
         "actions":[
         {
           "id": 4,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-09-14",
           "description": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 221."
         },
                  {
           "id": 3,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-09-14",
           "description": "Committee on Homeland Security and Governmental Affairs. Reported by Senator Johnson without amendment. With written report No. 115-157."
         },
                  {
           "id": 2,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-05-17",
           "description": "Committee on Homeland Security and Governmental Affairs. Ordered to be reported without amendment favorably."
         },
                  {
           "id": 1,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-05-11",
           "description": "Read twice and referred to the Committee on Homeland Security and Governmental Affairs."
         }
         ],
         "votes": [
         ]

      }
   ]
}
