{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "s199-115",
         "bill_slug": "s199",
         "congress": "115",
         "bill": "S.199",
         "bill_type": "s",
         "number": "S.199",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/s199.json",
         "title": "A bill to authorize the use of the active capacity of the Fontenelle Reservoir.",
         "short_title": "A bill to authorize the use of the active capacity of the Fontenelle Reservoir.",
         "sponsor_title": "Sen.",
         "sponsor": "John Barrasso",
         "sponsor_id": "B001261",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/B001261.json",
         "sponsor_party": "R",
         "sponsor_state": "WY",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115s199rs/pdf/BILLS-115s199rs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/senate-bill/199",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/s199",
         "introduced_date": "2017-01-24",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 1,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Water Resources Development",
         "committees": "Senate Energy and Natural Resources Committee",
         "committee_codes": ["SSEG"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-06-08",
         "latest_major_action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 126.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "This bill authorizes the Department of the Interior, in cooperation with the state of Wyoming, to amend the Definite Plan Report for the Seedskadee Project (authorized under the Colorado River Storage Project Act) to provide for the study, design, planning, and construction activities that will enable the use of all active storage capacity of Fontenelle Dam and Reservoir, including the placement of sufficient riprap on the upstream face of the dam to allow such storage capacity to be used for authorized project purposes. Interior may enter into: (1) any contract, grant, cooperative agreement, or other agreement that is necessary to carry out this bill; and (2) contracts with Wyoming for division of any additional active capacity made available under this bill. Interior must enter into a cooperative agreement with Wyoming for planning, design, related preconstruction activities, and construction of any modification of the Fontenelle Dam, which shall specify the responsibilities of Interior and Wyoming regarding: (1) completing the planning and final design of the modification of the dam, (2) any environmental and cultural resource compliance activities required for the modification of the dam, and (3) the construction of the modification of the dam.",
         "summary_short": "This bill authorizes the Department of the Interior, in cooperation with the state of Wyoming, to amend the Definite Plan Report for the Seedskadee Project (authorized under the Colorado River Storage Project Act) to provide for the study, design, planning, and construction activities that will enable the use of all active storage capacity of Fontenelle Dam and Reservoir, including the placement of sufficient riprap on the upstream face of the dam to allow such storage capacity to be used for...",
         "versions":[
],
         "actions":[
         {
           "id": 4,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-06-08",
           "description": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 126."
         },
                  {
           "id": 3,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-06-08",
           "description": "Committee on Energy and Natural Resources. Reported by Senator Murkowski without amendment. With written report No. 115-96."
         },
                  {
           "id": 2,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-03-30",
           "description": "Committee on Energy and Natural Resources. Ordered to be reported without amendment favorably."
         },
                  {
           "id": 1,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-01-24",
           "description": "Read twice and referred to the Committee on Energy and Natural Resources."
         }
         ],
         "votes": [
         ]

      }
   ]
}
