{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "s239-115",
         "bill_slug": "s239",
         "congress": "115",
         "bill": "S.239",
         "bill_type": "s",
         "number": "S.239",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/s239.json",
         "title": "Energy Savings Through Public-Private Partnerships Act of 2017",
         "short_title": "Energy Savings Through Public-Private Partnerships Act of 2017",
         "sponsor_title": "Sen.",
         "sponsor": "Cory Gardner",
         "sponsor_id": "G000562",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/G000562.json",
         "sponsor_party": "R",
         "sponsor_state": "CO",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115s239rs/pdf/BILLS-115s239rs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/senate-bill/239",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/s239",
         "introduced_date": "2017-01-30",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 3,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Energy",
         "committees": "Senate Energy and Natural Resources Committee",
         "committee_codes": ["SSEG"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-05-24",
         "latest_major_action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 98.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Energy Savings Through Public-Private Partnerships Act of 2017 (Sec. 2) This bill amends the National Energy Conservation Policy Act to revise requirements for energy savings performance contracts and utility energy service contracts (performance contracts). These contracts allow federal agencies to work with private contractors on energy efficiency upgrades to federal facilities, unless the facilities are dams, reservoirs, or hydropower facilities owned or operated by federal agencies. Current law requires federal facility energy managers to evaluate and identify energy and water efficiency measures for federal facilities, but agencies are not required to implement the measures. The bill requires agencies to implement the measures if they are cost-effective. The Department of Energy must report to the President and Congress on each agency's performance contracts, including their investment value and their energy savings. The energy conservation measures that may be contained in performance contracts are expanded by including those involving energy consuming devices and required support structures. Agencies may not limit recognition of operation and maintenance savings associated with energy systems that were modernized or replaced with energy conservation measures and water conservation measures (e.g., lower energy and water bills due to energy efficiency and conservation measures). Agencies may sell or transfer energy savings and apply the proceeds to fund a performance contract.  The energy savings that may be contained in performance contracts are expanded to include: (1) the use, sale, or transfer of energy incentives, rebates, or credits (including renewable energy credits) from governments or utilities; and (2) any revenue generated from a reduction in energy or water use, more efficient waste recycling, or additional energy generated from more efficient equipment. ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Energy Savings Through Public-Private Partnerships Act of 2017 (Sec. 2) This bill amends the National Energy Conservation Policy Act to revise requirements for energy savings performance contracts and utility energy service contracts (performance contracts). These contracts allow federal agencies to work with private contractors on energy efficiency upgrades to fe...",
         "versions":[
],
         "actions":[
         {
           "id": 4,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-05-24",
           "description": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 98."
         },
                  {
           "id": 3,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-05-24",
           "description": "Committee on Energy and Natural Resources. Reported by Senator Murkowski without amendment. With written report No. 115-79."
         },
                  {
           "id": 2,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-03-30",
           "description": "Committee on Energy and Natural Resources. Ordered to be reported without amendment favorably."
         },
                  {
           "id": 1,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-01-30",
           "description": "Read twice and referred to the Committee on Energy and Natural Resources."
         }
         ],
         "votes": [
         ]

      }
   ]
}
