{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "s508-115",
         "bill_slug": "s508",
         "congress": "115",
         "bill": "S.508",
         "bill_type": "s",
         "number": "S.508",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/s508.json",
         "title": "Western Oregon Tribal Fairness Act",
         "short_title": "Western Oregon Tribal Fairness Act",
         "sponsor_title": "Sen.",
         "sponsor": "Ron Wyden",
         "sponsor_id": "W000779",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/W000779.json",
         "sponsor_party": "D",
         "sponsor_state": "OR",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115s508rs/pdf/BILLS-115s508rs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/senate-bill/508",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/s508",
         "introduced_date": "2017-03-02",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 1,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Native Americans",
         "committees": "Senate Energy and Natural Resources Committee",
         "committee_codes": ["SSEG"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-05-23",
         "latest_major_action": "Star Print ordered on report 115-65.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Western Oregon Tribal Fairness Act TITLE I--COW CREEK UMPQUA LAND CONVEYANCE (Sec. 102) This bill requires that 17,519 acres of land be held in trust for, and be part of the reservation of, the Cow Creek Band of Umpqua Tribe of Indians. This land is taken into trust when the Department of the Interior and the tribe enter an agreement that secures certain access to the land. (Sec. 104) Federal law applies to the export of unprocessed logs harvested from this land and to forest management on this land. Gaming on this land is prohibited. This land is not subject to the land use planning requirements of the Federal Land Policy and Management Act of 1976 or the Act of August 28, 1937. (Sec. 105) Interior must reclassify public domain land as Oregon and California Railroad grant land in equal acreage as grant land taken into trust under this bill. TITLE II--OREGON COASTAL LAND CONVEYANCE (Sec. 202) This bill requires that 14,742 acres of land be held in trust for, and be part of the reservation of, the Confederated Tribes of Coos, Lower Umpqua, and Siuslaw Indians. This land is taken into trust when Interior and the tribes enter an agreement that secures existing Interior access to the land and secures access for activities including land management, surveys, and transit of public vehicles. (Sec. 204) Federal law applies to the export of unprocessed logs harvested from this land and to forest management on this land. Gaming on this land is prohibited. This land is not subject to the land use planning requirements of the Federal Land Policy and Management Act of 1976 or the Act of August 28, 1937. (Sec. 205) Interior must reclassify public domain land as Oregon and California Railroad grant land in equal acreage as grant land taken into trust under this bill. TITLE III--AMENDMENTS TO COQUILLE RESTORATION ACT (Sec. 301) This bill amends the Coquille Restoration Act to remove the requirement that Interior manage the Coquille Forest in accordance with state and federal forestry and environmental protection laws. Federal law applies to the export of unprocessed logs harvested from this land. Sales of timber from this land must be advertised, offered, and awarded according to competitive bidding practices. This bill strikes a provision giving the U.S. District Court for the District of Oregon jurisdiction over certain actions concerning the Coquille Forest and limiting remedies to equitable relief. ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Western Oregon Tribal Fairness Act TITLE I--COW CREEK UMPQUA LAND CONVEYANCE (Sec. 102) This bill requires that 17,519 acres of land be held in trust for, and be part of the reservation of, the Cow Creek Band of Umpqua Tribe of Indians. This land is taken into trust when the Department of the Interior and the tribe enter an agreement that secures certain access to...",
         "versions":[
],
         "actions":[
         {
           "id": 5,
           "chamber": "Senate",
           "action_type": "Floor",
           "datetime": "2017-05-23",
           "description": "Star Print ordered on report 115-65."
         },
                  {
           "id": 4,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-05-16",
           "description": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 83."
         },
                  {
           "id": 3,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-05-16",
           "description": "Committee on Energy and Natural Resources. Reported by Senator Murkowski without amendment. With written report No. 115-65."
         },
                  {
           "id": 2,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-03-30",
           "description": "Committee on Energy and Natural Resources. Ordered to be reported without amendment favorably."
         },
                  {
           "id": 1,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-03-02",
           "description": "Read twice and referred to the Committee on Energy and Natural Resources."
         }
         ],
         "votes": [
         ]

      }
   ]
}
