{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "s617-115",
         "bill_slug": "s617",
         "congress": "115",
         "bill": "S.617",
         "bill_type": "s",
         "number": "S.617",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/s617.json",
         "title": "Lower Farmington River and Salmon Brook Wild and Scenic River Act",
         "short_title": "Lower Farmington River and Salmon Brook Wild and Scenic River Act",
         "sponsor_title": "Sen.",
         "sponsor": "Christopher S. Murphy",
         "sponsor_id": "M001169",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/M001169.json",
         "sponsor_party": "D",
         "sponsor_state": "CT",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115s617rs/pdf/BILLS-115s617rs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/senate-bill/617",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/s617",
         "introduced_date": "2017-03-14",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 1,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Public Lands and Natural Resources",
         "committees": "Senate Energy and Natural Resources Committee",
         "committee_codes": ["SSEG"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-05-09",
         "latest_major_action": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 68.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Lower Farmington River and Salmon Brook Wild and Scenic River Act  (Sec. 3) This bill amends the Wild and Scenic Rivers Act to designate specified segments of the Lower Farmington River and Salmon Brook in Connecticut as components of the National Wild and Scenic Rivers System.   (Sec. 4) The Department of the Interior shall manage: (1) the river segments according to the Lower Farmington River and Salmon Brook Management Plan, dated June 2011; and (2) coordinate the management responsibilities of Interior under this  bill relating to such segments with the Lower Farmington River and Salmon Brook Wild and Scenic Committee.  Interior may enter into cooperative agreements with: (1) the state of Connecticut; (2) the towns of Avon, Bloomfield, Burlington, East Granby, Farmington, Granby, Hartland, Simsbury, and Windsor in Connecticut; and (3) appropriate local planning and environmental organizations.  For purposes of the segments designated by this bill, the zoning ordinances adopted by the towns, including provisions for the conservation of floodplains, wetlands, and watercourses associated with such segments, shall be deemed to satisfy the Act's standards and requirements limiting or prohibiting federal acquisition of lands by condemnation.  The authority of Interior to acquire lands for the purposes of such segments shall be limited to acquisition by donation or with the owner's consent and shall be subject to additional management plan criteria.   The designation made by this bill shall not be construed to: (1) prohibit, pre-empt, or abridge future licensing of the Rainbow Dam and Reservoir by the Federal Energy Regulatory Commission (FERC) as a federally licensed hydroelectric generation project, provided that FERC may establish any terms and conditions in a hydropower license for the dam as necessary to reduce impacts that invade or unreasonably diminish the scenic, recreational, and fish and wildlife values of the designated segments; or (2) affect the operation of, or impose any flow or release requirements on, the unlicensed hydroelectric facility at the dam and reservoir.   The Lower Farmington River shall not be administered as part of the National Park System (NPS) or be subject to NPS regulations.  (Sec. 5) The bill also revises the description of a specified designated segment of the Farmington River in Connecticut.",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Lower Farmington River and Salmon Brook Wild and Scenic River Act  (Sec. 3) This bill amends the Wild and Scenic Rivers Act to designate specified segments of the Lower Farmington River and Salmon Brook in Connecticut as components of the National Wild and Scenic Rivers System.   (Sec. 4) The Department of the Interior shall manage: (1) the river segments accordin...",
         "versions":[
],
         "actions":[
         {
           "id": 4,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-05-09",
           "description": "Placed on Senate Legislative Calendar under General Orders. Calendar No. 68."
         },
                  {
           "id": 3,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-05-09",
           "description": "Committee on Energy and Natural Resources. Reported by Senator Murkowski without amendment. With written report No. 115-55."
         },
                  {
           "id": 2,
           "chamber": "Senate",
           "action_type": "Committee",
           "datetime": "2017-03-30",
           "description": "Committee on Energy and Natural Resources. Ordered to be reported without amendment favorably."
         },
                  {
           "id": 1,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-03-14",
           "description": "Read twice and referred to the Committee on Energy and Natural Resources."
         }
         ],
         "votes": [
         ]

      }
   ]
}
