{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr3162-115",
         "bill_slug": "hr3162",
         "congress": "115",
         "bill": "H.R.3162",
         "bill_type": "hr",
         "number": "H.R.3162",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr3162.json",
         "title": "Legislative Branch Appropriations Act, 2018",
         "short_title": "Legislative Branch Appropriations Act, 2018",
         "sponsor_title": "Rep.",
         "sponsor": "Kevin Yoder",
         "sponsor_id": "Y000063",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/Y000063.json",
         "sponsor_party": "R",
         "sponsor_state": "KS",
         "gpo_pdf_uri": null,
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/3162",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr3162",
         "introduced_date": "2017-07-06",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 0,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Congress",
         "committees": "House Appropriations Committee",
         "committee_codes": ["HSAP"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-07-06",
         "latest_major_action": "Placed on the Union Calendar, Calendar No. 136.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for the legislative branch, including the House of Representatives and Joint Items such as: the Joint Economic Committee, the Joint Committee on Taxation (JCT), and the Office of the Attending Physician.  It also provides appropriations for:    the Capitol Police,   the Congressional Budget Office (CBO),   the Architect of the Capitol (AOC),   the Library of Congress (LOC),   the Government Publishing Office (GPO),   the Government Accountability Office (GAO), and   the Open World Leadership Center.   Pursuant to a longstanding practice under which each chamber of Congress determines its own requirements, the House bill does not include funds for the Senate.  The bill increases overall legislative branch funding above the FY2017 level and includes an increase for the House of Representatives.  For other legislative branch agencies and programs, the bill increases funding above FY2017 levels for the Capitol Police, the AOC, the CBO, and the LOC. The bill funds the GPO and the GAO at FY2017 levels. The bill also includes provisions that would:  prohibit a cost of living adjustment for Members of Congress; establish senior level JCT positions to meet critical scientific, technical, professional, or executive needs; and restrict the delivery to congressional offices of printed copies of legislation and materials such as the Congressional Record and the U.S. Code.  Full Summary:  Legislative Branch Appropriations Act, 2018  TITLE I--LEGISLATIVE BRANCH  Provides appropriations to the House of Representatives for:    Salaries and Expenses;   House Leadership Offices;   Members' Representational Allowances, including Members' Clerk Hire, Official Expenses of Members, and Official Mail;   Committee Employees;   Salaries, Officers, and Employees; and  Allowances and Expenses.   (In this bill, the term \"Member of the House of Representatives\" also includes a Delegate or Resident Commissioner to the Congress.)  (Sec. 101) Requires amounts remaining in Members' Representational Allowances after all payments are made for FY2018 to be used for deficit or debt reduction.  (Sec. 102) Prohibits funds provided by this bill from being used to deliver a printed copy of a bill, joint resolution, or resolution to the office of a Member of the House of Representatives unless the Member requests a copy.  (Sec. 103) Prohibits funds provided by this bill from being used to deliver a printed copy of the Congressional Record to the office of a Member of the House of Representatives.  (Sec. 104) Prohibits funds provided by this bill from being used to make payments from any Members' Representational Allowance to lease a vehicle, excluding mobile district offices, at a rate that exceeds $1,000 for the vehicle in any month.  (Sec. 105) Prohibits funds provided by this bill from being used to provide an aggregate number of more than 50 printed copies of any edition of the U.S. Code to all offices of the House of Representatives.  (Sec. 106) Prohibits funds provided by this bill from being used to deliver a printed copy of the report of disbursements for the operations of the House of Representatives to the office of a Member of the House of Representatives.  (Sec. 107) Prohibits funds provided by this bill from being used to deliver to the office of a Member of the House Representatives a printed copy of the Daily Calendar of the House of Representatives prepared by the Clerk of the House of Representatives.  (Sec. 108) Prohibits funds provided by this bill from being used to deliver a printed copy of the Congressional Pictorial Directory to the office of a Member of the House of Representatives.  (Sec. 109) Amends the Legislative Branch Appropriations Act, 2005 to include in the House Services Revolving Fund service fees that are collected from vendors of the Master Web Services Agreement or the Technology Services Contract for failing to abide by and maintain House of Representatives security policies. (Sec. 110) Prohibits cost of living adjustments for Members of Congress during FY2018.   Provides appropriations for Joint Items, including:   the Joint Economic Committee,   the Joint Committee on Taxation,   the Office of the Attending Physician, and   the Office of Congressional Accessibility Services.   (Sec. 1001) Establishes senior level Joint Committee on Taxation positions to meet critical scientific, technical, professional, or executive needs and limits the compensation for the positions to level II of the Executive Schedule.  Provides appropriations for:    the Capitol Police,   the Office of Compliance, and  the Congressional Budget Office (CBO).   Provides appropriations to the Architect of the Capitol (AOC) for:   Capital Construction and Operations;   the Capitol Building;   the Capitol Grounds;   the House Office Buildings;   the Capitol Power Plant;   the Library Buildings and Grounds;   the Capitol Police Buildings, Grounds and Security;   the Botanic Garden; and   the Capitol Visitor Center.   (Sec. 1101) Prohibits funds provided by this bill for the AOC from being used to make incentive or award payments to contractors for work that is behind schedule or over budget, unless the deviations are due to unforeseeable events, government-driven scope changes, or are insignificant within the overall scope of the project or program.  (Sec. 1102) Prohibits funds provided by this bill from being used for scrims (coverings for buildings that are being renovated) containing photographs of building facades during restoration or construction projects performed by the AOC.  Provides appropriations to the Library of Congress (LOC) for:    Salaries and Expenses,   the Copyright Office,   the Congressional Research Service, and   Books for the Blind and Physically Handicapped.   (Sec. 1201) Limits the FY2018 obligational authority of the LOC for reimbursable and revolving fund activities funded from sources other than appropriations.  Provides appropriations to the Government Publishing Office for:    Congressional Publishing,   Public Information Programs of the Superintendent of Documents, and   the Government Publishing Office Business Operations Revolving Fund.   Provides appropriations to:   the Government Accountability Office,  the Open World Leadership Center Trust Fund, and   the John C. Stennis Center for Public Service Training and Development.   TITLE II--GENERAL PROVISIONS  (Sec. 201) Prohibits funds provided by this bill from being used for the maintenance or care of private vehicles, except for emergency assistance and cleaning.  (Sec. 202) Prohibits funds provided by this bill from remaining available for obligation beyond FY2018 unless expressly provided in this bill.  (Sec. 203) Provides that: (1) rates of compensation or designations of offices or positions included in this bill that are either not established by the Legislative Pay Act of 1929 or are contrary to that Act are considered permanent law, and (2) provisions in this bill for official congressional expenses and clerk hire for Senators and Members of the House of Representatives are permanent law.  (Sec. 204) Limits contracts for certain consulting services to those where expenditures are a matter of public record and available for public inspection.  (Sec. 205) Permits legislative branch entities participating in the Legislative Branch Financial Managers Council to use funds provided for administrative expenses to pay a share of the cost of the council if the total cost shared among all participating entities does not exceed $2,000.  (Sec. 206) Prohibits funds provided by this bill from being transferred to any department, agency, or instrumentality of the U.S. government unless the transfer is pursuant to authority provided by an appropriations Act. (Sec. 207) Prohibits the AOC from using funds provided by this bill to eliminate or restrict guided Capitol tours led by congressional employees and interns, subject to an exception permitting tours to be suspended for security or related reasons.  (Sec. 208) Establishes a spending reduction account for the amount by which spending proposed in this bill exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0. (Under the Rules of the House of Representatives, any savings included in the spending reduction account are not available for further appropriation during consideration of the bill.) ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for the legislative branch, including the House of Representatives and Joint Items such as: the Joint Economic Committee, the Joint Committee on Taxation (JCT), and the Office of the Attending Physician.  It also provides appropriations for:    the Capitol Police,   the Congressional Budget Office (CBO),   the ...",
         "versions":[
],
         "actions":[
         {
           "id": 2,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-07-06",
           "description": "Placed on the Union Calendar, Calendar No. 136."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-07-06",
           "description": "The House Committee on Appropriations reported an original measure, H. Rept. 115-199, by Mr. Yoder."
         }
         ],
         "votes": [
         ]

      }
   ]
}
