{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr3219-115",
         "bill_slug": "hr3219",
         "congress": "115",
         "bill": "H.R.3219",
         "bill_type": "hr",
         "number": "H.R.3219",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr3219.json",
         "title": "Make America Secure Appropriations Act, 2018",
         "short_title": "Make America Secure Appropriations Act, 2018",
         "sponsor_title": "Rep.",
         "sponsor": "Kay Granger",
         "sponsor_id": "G000377",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/G000377.json",
         "sponsor_party": "R",
         "sponsor_state": "TX",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr3219rh/pdf/BILLS-115hr3219rh.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/3219",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr3219",
         "introduced_date": "2017-07-13",
         "active": true,
         "house_passage": "2017-07-26",
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 0,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Armed Forces and National Security",
         "committees": "House Appropriations Committee",
         "committee_codes": ["HSAP"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-08-01",
         "latest_major_action": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 187.",
         "last_vote_date": "2017-07-27",
         "house_passage_vote": "2017-07-26",
         "senate_passage_vote": null,
         "summary": "Highlights:  This bill provides FY2018 appropriations for several federal agencies. The bill includes 4 of the 12 regular FY2018 appropriations bills, including:    the Department of Defense Appropriations Act, 2018;   the Legislative Branch Appropriations Act, 2018;   the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2018; and   the Energy and Water Development and Related Agencies Appropriations Act, 2018.   The bill also includes the Department of Homeland Security Border Infrastructure Construction Appropriations Act, 2018 which provides funding to U.S. Customs and Border Protection for the construction of fencing and a wall along the Southern border.  The bill provides additional Overseas Contingency Operations/ Global War on Terrorism funding which is exempt from discretionary spending limits.  Full Summary:  Defense, Military Construction, Veterans Affairs, Legislative Branch, and Energy and Water Development National Security Appropriations Act, 2018 or the Make America Secure Appropriations Act, 2018  Department of Defense Appropriations Act, 2018  DIVISION A--DEPARTMENT OF DEFENSE APPROPRIATIONS ACT, 2018  This division provides FY2018 appropriations to the Department of Defense (DOD) for military activities, including appropriations for Overseas Contingency Operations (OCO)/ Global War on Terrorism. TITLE I--MILITARY PERSONNEL  Provides appropriations for active-duty and reserve personnel in the Army, Navy, Marine Corps, and Air Force (the military departments), and for National Guard personnel in the Army and Air Force.  TITLE II--OPERATION AND MAINTENANCE  Provides appropriations for Operation and Maintenance (O&amp;M) for the military departments, other DOD agencies, the Reserve Components, and the Army and Air National Guard.  Provides appropriations for:    the U.S. Court of Appeals for the Armed Forces;   Environmental Restoration for the military departments, DOD agencies, and at Formerly Used Defense Sites;   Overseas Humanitarian, Disaster, and Civic Aid;   the Cooperative Threat Reduction Account; and   the O&amp;M, National Defense Restoration Fund.   TITLE III--PROCUREMENT  Provides appropriations for Procurement by the military departments, including:    Aircraft;   Missiles;   Weapons and Tracked Combat Vehicles;   Ammunition;   Spacecraft, Rockets, and Related Equipment; and   Shipbuilding and Conversion by the Navy.   Provides appropriations for:    Defense-Wide Procurement;   Defense Production Act Purchases; and   the Procurement, National Defense Restoration Fund.   TITLE IV--RESEARCH, DEVELOPMENT, TEST AND EVALUATION  Provides appropriations for Research, Development, Test, and Evaluation (RDT&amp;E) by the military departments and defense agencies.  Provides appropriations for: (1) the RDT&amp;E, National Defense Restoration Fund; and (2) Operational Test and Evaluation.  TITLE V--REVOLVING AND MANAGEMENT FUNDS  Provides appropriations for the Defense Working Capital Funds.  TITLE VI--OTHER DEPARTMENT OF DEFENSE PROGRAMS  Provides appropriations for other DOD programs, including:    the Defense Health Program,   Chemical Agents and Munitions Destruction,   Drug Interdiction and Counter-Drug Activities, and   the Office of the Inspector General.   TITLE VII--RELATED AGENCIES  Provides appropriations for the Central Intelligence Agency Retirement and Disability System Fund and the Intelligence Community Management Account.  TITLE VIII--GENERAL PROVISIONS  (Sec. 8001) Prohibits appropriations provided by this division from being used for publicity or propaganda purposes not authorized by Congress.  (Sec. 8002) Exempts DOD from laws prohibiting the compensation or employment of foreign nationals if specified conditions are met.  (Sec. 8003) Prohibits funding provided by this division from remaining available for obligation beyond the current fiscal year unless this division expressly provides otherwise.  (Sec. 8004) Prohibits more than 20% of the appropriations provided by this division for the current fiscal year from being obligated during the last two months of the fiscal year, with an exception for support of active duty training of reserve components or summer camp training of the Reserve Officers' Training Corps.  (Sec. 8005) Specifies authorities and restrictions for transferring specified funds provided by this division for other military functions.  (Sec. 8006) Requires tables included in the report accompanying this division to be treated as if they were included in the text of this division.  (Sec. 8007) Requires DOD to submit a report to Congress to establish the baseline for application of reprogramming and transfer authorities for FY2018. Prohibits funds provided by this division from being reprogrammed or transferred until the report is provided or DOD certifies to Congress that the reprogramming or transfer is necessary as an emergency requirement. Includes exceptions for: (1) the Environmental Restoration accounts, and (2) Drug Interdiction and Counter-drug activities.  (Sec. 8008) Prohibits cash balances in DOD Working Capital Funds from exceeding the level necessary for cash disbursements to be made from the funds. Sets forth requirements and limitations for transfers of balances in the funds to specified accounts.  (Sec. 8009) Prohibits the initiation of a special access program without notifying Congress in advance.  (Sec. 8010) Establishes limitations and conditions on the use of funds provided by this division to initiate or terminate certain multiyear procurement contracts.  (Sec. 8011) Appropriates O&amp;M funds for the costs of humanitarian and civic assistance provided in conjunction with military operations.  (Sec. 8012) Prohibits DOD from managing civilian personnel on the basis of any end-strength or subjecting civilian personnel to any end-strength limitations.  (Sec. 8013) Prohibits funds provided by this division from being used to directly or indirectly influence congressional action on legislation or appropriation matters pending before Congress.  (Sec. 8014) Prohibits compensation from being paid to any member of the Army participating as a full-time student and receiving benefits paid by the Department of Veterans Affairs from the DOD Education Benefits Fund if the time spent as a student is counted toward the member's service commitment. Applies the restriction only to active components of the Army and exempts members that have reenlisted with this option prior to October 1, 1987.  (Sec. 8015) Permits funds appropriated in title III of this division for the Department of Defense Pilot Mentor-Protege Program to be transferred to any other account contained in this division to implement a developmental assistance agreement under the program.  (Sec. 8016) Prohibits DOD from purchasing certain anchor and mooring chains unless they are manufactured in the United States.  (Sec. 8017) Prohibits funds from being used to demilitarize or dispose of certain small firearms, small arms ammunition, or ammunition components that are not otherwise prohibited from commercial sale under federal law, unless the Army has certified that the small arms, ammunition, or components are unserviceable or unsafe for further use.  (Sec. 8018) Limits funding for the relocation of any DOD entity into or within the National Capital Region. Permits DOD to waive the limitation by certifying to Congress that a relocation is required in the best interest of the government.  (Sec. 8019) Provides specified funds for incentive payments for federal contracts involving contractors, subcontractors, or suppliers that are Indian organizations or Indian-owned economic enterprises.  (Sec. 8020) Prohibits funds provided by this division for the Defense Media Activity from being used for national or international political or psychological activities.  (Sec. 8021) Permits DOD to incur obligations of up to $350 million for DOD military compensation, construction projects, and supplies and services in anticipation of contributions from the government of Kuwait.  (Sec. 8022) Provides appropriations from specified Air Force accounts to support Civil Air Patrol Corporation operation and maintenance, procurement, readiness, counterdrug activities, drug demand reduction activities involving youth programs, and vehicle procurement.  (Sec. 8023) Prohibits funds provided by this division from being used to establish a new DOD federally-funded research and development center (FFRDC). Limits compensation for FFRDC members or consultants.  Prohibits a defense FFRDC from using FY2018 DOD funds for new building construction, cost-sharing payments for projects funded by government grants, absorption of contract overruns, or certain charitable contributions.  Limits the staff years that may be funded for FFRDCs from FY2018 funds, and requires DOD to submit a report on the allocation of staff years with the FY2019 budget request.  Reduces the total amount appropriated by this division for FFRDCs.  (Sec. 8024) Prohibits DOD from procuring carbon, alloy, or armor steel plating not melted and rolled in the United States or Canada. Permits DOD to waive the prohibition if adequate domestic supplies are not available and an acquisition is necessary for national security purposes.  (Sec. 8025) Specifies that \"congressional defense committees\" includes the Senate and House Armed Services Committees and Appropriations Subcommittees on Defense.  (Sec. 8026) Permits DOD to acquire the modification, depot maintenance, and repair of aircraft, vehicles, and vessels; and production of components through competition between DOD activities and private firms.  (Sec. 8027) Revokes blanket waivers of the Buy American Act if DOD determines that a country has violated the terms of a specified agreement by discriminating against products produced in the United States.  (Sec. 8028) Permits funds in the Department of Defense Overseas Military Facility Investment Recovery Account to remain available until expended.  (Sec. 8029) Permits the Air Force to convey to Indian tribes located in Nevada, Idaho, North Dakota, South Dakota, Montana, Oregon, Minnesota, and Washington relocatable military housing units currently located at Grand Forks, Malmstrom, Mountain Home, Ellsworth, and Minot Air Force Bases that are excess to the needs of the Air Force. Requires the Operation Walking Shield Program to resolve any housing unit conflicts arising among requests of Indian tribes for these conveyances.  (Sec. 8030) Permits O&amp;M appropriations to be used to purchase items with an investment unit cost of not more than $250,000.  (Sec. 8031) Prohibits the use of funds provided by this division to disestablish, close, downgrade from host to extension center, or place on probation a Senior Reserve Officers' Training Corps program.  (Sec. 8032) Requires DOD to issue regulations to: (1) prohibit the sale of tobacco or tobacco-related products in military resale outlets in the United States, its territories, and possessions at a price below the most competitive price in the local community; and (2) require the prices in overseas military retail outlets to be within the range of prices established for military retail systems stores in the United States.  (Sec. 8033) Prohibits the use of DOD Working Capital Funds to purchase specified investment items.  (Sec. 8034) Prohibits funds provided for the Central Intelligence Agency (CIA) from remaining available for obligation beyond the current fiscal year, except for funds provided for the Reserve for Contingencies, the Working Capital Fund, or other specified programs.  (Sec. 8035) Permits funds made available by this division to the Defense Intelligence Agency to be used for the design, development, and deployment of General Defense Intelligence Program intelligence communication and intelligence information systems.  (Sec. 8036) Requires specified Operation and Maintenance, Defense-Wide funds to be used for the mitigation of environmental impacts on Indian lands resulting from DOD activities.  (Sec. 8037) Requires DOD to comply with the Buy American Act.  (Sec. 8038) Prohibits funds provided by this division from being used to: (1) establish a field operating agency, or (2) pay a member of the Armed Forces or civilian employee transferred or reassigned from a headquarters activity if the employee's place of duty remains at headquarters. Specifies exceptions and permits waivers that will reduce personnel or financial requirements of the department.  (Sec. 8039) Prohibits funds provided by this division from being used to convert a function performed by DOD civilian employees to performance by a contractor unless specific requirements are met.  (Sec. 8040) Rescinds specified funds provided by prior appropriations divisions for Procurement and RDT&amp;E.  (Sec. 8041) Prohibits funds provided by this division from being used to reduce authorized positions for military technicians (dual status) of the Army National Guard, Air National Guard, Army Reserve, and Air Force Reserve unless the reductions are a direct result of a reduction in military force structure.  (Sec. 8042) Prohibits funds provided by this division from being used for assistance to North Korea unless the funds are specifically appropriated for that purpose.  (Sec. 8043) Permits O&amp;M funds provided by this division to be used to reimburse the National Guard and Reserve for providing intelligence or counterintelligence support to the combatant commands, defense agencies, and joint intelligence activities.  (Sec. 8044) Prohibits the transfer of DOD or CIA drug interdiction or counter-drug activity funds to any other department or agency except as specifically provided in an appropriations law.  (Sec. 8045) Requires ball and roller bearings purchased using funds provided by this division to be produced by a domestic source. Permits DOD to waive the prohibition if adequate domestic supplies are not available and an acquisition is necessary for national security.  (Sec. 8046) Prohibits funds provided by this division from being used for Evolved Expendable Launch Vehicle (EELV) launch service competitions unless the competitions are open to all certified providers of EELV systems. Requires the award to be made to the provider that offers the best value to the government.  (Sec. 8047) Appropriates funds to DOD for grants to the United Service Organizations and the Red Cross.  (Sec. 8048) Prohibits funds provided by this division from being used to purchase any supercomputer not manufactured in the United States unless it is unavailable from U.S. manufacturers and is necessary for national security.  (Sec. 8049) Requires the Small Business Innovation Research program and the Small Business Technology Transfer program set-asides to be taken proportionally from all programs, projects, or activities that contribute to the extramural budget.  (Sec. 8050) Prohibits funds in this division from being used for contractor bonuses being paid due to a business restructuring.  (Sec. 8051) Permits the transfer of specified O&amp;M funds to pay military personnel for support and services for eligible organizations and activities outside DOD.  (Sec. 8052) Permits DOD to dispose of negative unliquidated or unexpended balances for expired or closed accounts by charging an obligation to a current account for the same purpose as the expired or closed account.  (Sec. 8053) Permits the National Guard to allow the use of equipment of the National Guard Distance Learning Project by any person or entity on a space-available, reimbursable basis.  (Sec. 8054) Prohibits DOD funds from being used to modify command and control relationships to give Fleet Forces Command operational and administrative control of U.S. Navy forces assigned to the Pacific fleet. Provides that command and control relationships that existed on October 1, 2004, shall remain in effect until a written modification has been proposed to congressional appropriations committees.  Specifies that the proposed modification: (1) may be implemented 30 days after the committees are notified unless an objection is received from the committees, and (2) may not preclude the ability of the commander of the U.S. Pacific Command to meet operational requirements.  (Sec. 8055) Requires specified O&amp;M funds to be used for continued implementation and expansion of the Sexual Assault Special Victims Counsel Program.  (Sec. 8056) Prohibits the use of funds provided in title IV to procure end-items for delivery to military forces for operational training, operational use, or inventory requirements. Includes exceptions and permits a waiver for national security purposes.  (Sec. 8057) Permits DOD to waive limitations on the procurement of defense items from a foreign country if: (1) the limitations would invalidate cooperative programs or reciprocal trade agreements, and (2) the country does not discriminate against the same or similar items procured in the United States. Provides exceptions.  (Sec. 8058) Prohibits funds provided by this division or other DOD appropriations bills from being used for repairs or maintenance for military family housing units.  (Sec. 8059) Requires DOD to submit a report to Congress before obligating specified RDT&amp;E funds appropriated by this division for any new start advanced concept technology demonstration project or joint capability demonstration project. Permits DOD to waive the restriction by certifying to Congress that it is in the national interest.  (Sec. 8060) Requires DOD to continue to provide a classified quarterly report to Congress on matters specified in the classified annex accompanying this division.  (Sec. 8061) Permits a Reserve who is a member of the National Guard serving on full-time duty to support ground-based elements of the National Ballistic Missile Defense System.  (Sec. 8062) Prohibits funds provided by this division from being used to transfer ammunition held by DOD that has a center-fire cartridge and is designated as ''armor piercing'' to any nongovernmental entity, except for demilitarization purposes.  (Sec. 8063) Permits the Chief of the National Guard Bureau to waive payment for leases of personal property for not more than a year to certain youth, social, charitable, or fraternal nonprofit organizations.  (Sec. 8064) Provides for the transfer of specified Army O&amp;M funds to other activities of the federal government for classified purposes. Permits DOD to enter into and carry out contracts for the acquisition of real property, construction, personal services, and operations related to projects carrying out the purposes of this section.  (Sec. 8065) Prohibits funds from being used to make specified modifications to the budget and appropriations process for the National Intelligence Program.  (Sec. 8066) Provides appropriations to remain available until expended for grants for the construction and furnishing of additional Fisher Houses to meet the needs of military family members confronted with the illness or hospitalization of an eligible military beneficiary.  (Sec. 8067) Provides specified Procurement and RDT&amp;E funds for the Israeli Cooperative Programs. Specifies funding for the Iron Dome defense system for countering short-range rocket threats, the Short Range Ballistic Missile Defense program, and related programs.  (Sec. 8068) Permits specified Shipbuilding and Conversion--Navy funds to remain available through FY2018 to fund prior year shipbuilding cost increases. Requires the funds to be transferred to specified accounts.  (Sec. 8069) Deems funds provided by this division for intelligence activities to be authorized by Congress during FY2018 until the enactment of the Intelligence Authorization Act for FY2018.  (Sec. 8070) Prohibits fund appropriated by this division from being used for a reprogramming of funds that creates or initiates a new program, project, or activity unless it must be undertaken immediately for national security and Congress is notified in advance.  (Sec. 8071) Requires the President's budget to include separate budget justification documents for costs of the Armed Forces' participation in contingency operations for the Military Personnel, O&amp;M, Procurement, and RDT&amp;E accounts.  (Sec. 8072) Prohibits funds provided by this division from being used for research, development, test, evaluation, procurement, or deployment of nuclear armed interceptors of a missile defense system.  (Sec. 8073) Reduces the total amount appropriated in this division to reflect savings due to favorable foreign exchange rates.  (Sec. 8074) Prohibits funds provided by this division from being used to reduce or disestablish the operation of the 53rd Weather Reconnaissance Squadron of the Air Force Reserve if the action would reduce the WC-130 Weather Reconnaissance mission below the levels funded in this division. Permits the Squadron to perform other missions in support of national defense requirements during the non-hurricane season.  (Sec. 8075) Prohibits funds provided by this division from being used for integrating foreign intelligence information unless the information has been lawfully collected and processed during authorized foreign intelligence activities. Requires information pertaining to U.S. persons to be handled in accordance with the Fourth Amendment of the U.S. Constitution as implemented through Executive Order No. 12333 (United States Intelligence Activities).  (Sec. 8076) Prohibits funds provided by this division from being used to transfer research and development, acquisition, or other program authority related to current tactical unmanned aerial vehicles from the Army. Requires the Army to retain responsibility for and operational control of the MQ-1C Gray Eagle Unmanned Aerial Vehicle.  (Sec. 8077) Prohibits funds appropriated by this division for programs of the Office of the Director of National Intelligence (ODNI) from being obligated beyond the current fiscal year except for research and technology funds, which remain available through FY2019.  (Sec. 8078) Provides for the adjustment of obligations within the Shipbuilding and Conversion--Navy appropriation.  (Sec. 8079) Requires the ODNI to submit a report to Congress establishing the baseline for application of reprogramming and transfer authorities for FY2018. Prohibits funds provided by this division for the National Intelligence Program from being transferred or reprogrammed until the report is submitted unless the action is necessary for an emergency.  (Sec. 8080) Prohibits funds provided by this division from being used to eliminate, restructure, realign, or make disproportionate personnel reductions at Army Contracting Command--New Jersey sites without notifying Congress in advance.  (Sec. 8081) Rescinds specified unobligated balances from the DOD Acquisition Workforce Development Fund.  (Sec. 8082) Prohibits funds provided by this division from being used to support any military training or operation that includes child soldiers unless the assistance is permitted by the Child Soldiers Prevention Act of 2008.  (Sec. 8083) Provides specific restrictions on the reprogramming or transfer of funds provided to the National Intelligence Program.  (Sec. 8084) Directs the ODNI to submit annually to Congress a future-years intelligence program reflecting estimated expenditures and proposed appropriations included in the President's budget.  (Sec. 8085) Specifies committees included in \"congressional intelligence committees\" for the purposes of this division.  (Sec. 8086) Permits specified O&amp;M funds provided in title II to be transferred by the military department concerned to its central fund established for Fisher Houses and Suites.  (Sec. 8087) Permits O&amp;M funds to be used for payments and transfers to the Defense Acquisition Workforce Development Fund.  (Sec. 8088) Requires agencies receiving funds in this division to post reports required to be submitted to Congress on the public website of the agency if it serves the national interest. Provides exceptions for national security or proprietary information.  (Sec. 8089) Prohibits the use of funds for federal contracts in excess of $1 million unless the contractor meets specific requirements regarding the resolution of claims under title VII of the Civil Rights Act of 1964 (discrimination based on race, color, religion, sex, or national origin). Allows DOD to waive the requirements to avoid harm to national security.  (Sec. 8090) Provides specified funds to be transferred to the Joint Department of Defense-Department of Veterans Affairs Medical Facility Demonstration Fund.  (Sec. 8091) Prohibits funds provided by this division from being used to: (1) provide certain missile defense information to the Russian Federation, subject to an exception for information regarding ballistic missile early warning; or (2) integrate a missile defense system of the Russian Federation or a missile defense system of the People's Republic of China into any missile defense system of the United States.  (Sec. 8092) Permits DOD funds to be used to purchase armored vehicles for the physical security of personnel or force protection and limits the cost per vehicle.  (Sec. 8093) Permits the ODNI to transfer specified funds provided by this division for the National Intelligence Program with the approval of the Office of Management and Budget, subject to certain requirements and restrictions.  (Sec. 8094) Prohibits funds from being used to transfer or release any individual detained at U.S. Naval Station, Guantanamo Bay, Cuba (Guantanamo) who is not a U.S. citizen or member of the Armed Forces into the United States, its territories, or possessions.  (Sec. 8095) Prohibits funding from being used to construct, acquire, or modify any U.S. facility (other than the facility at Guantanamo Bay, Cuba) to house any individual detained at Guantanamo.  (Sec. 8096) Prohibits funds provided by this division from being used to transfer any individual detained at Guantanamo to a country of origin or other foreign country or entity unless DOD makes certain certifications.  (Sec. 8097) Prohibits funds provided by this division from being used to violate the Wars Powers Resolution.  (Sec. 8098) Prohibits funds from being used to enter into specified agreements and transactions with Russian arms supplier Rosoboronexport. Permits DOD to waive the restriction if specific conditions are met.  (Sec. 8099) Prohibits funds provided by this division from being used for the purchase or manufacture of U.S. flags unless they are treated as covered items under Buy American requirements.  (Sec. 8100) Permits funds provided by this division to be used to provide ex gratia payments to local military commanders for damage, personal injury, or death that is incident to combat operations in a foreign country.  (Sec. 8101) Prohibits funds provided by this division from being used to reduce strategic delivery vehicles and launchers below levels necessary to implement the New Strategic Arms Reduction Treaty (New START), as set forth in a report provided to Congress pursuant to the National Defense Authorization Act for Fiscal Year 2012.  (Sec. 8102) Requires DOD to post grant awards on a public website in a searchable format.  (Sec. 8103) Prohibits funds provided by this division from being used for the performance of a flight demonstration team at a location outside of the United States if a performance of a flight demonstration team at a location within the United States was canceled during the year due to insufficient funding.  (Sec. 8104) Prohibits the National Security Agency (NSA) from using funds provided by this division to target a U.S. person under specified authorities granted by the Foreign Intelligence Surveillance Act of 1978 (FISA).  (Sec. 8105) Prohibits funds provided by this division from being used for the Arms Trade Treaty until it is ratified by the Senate.  (Sec. 8106) Prohibits the transfer of administrative responsibilities or budgetary resources of any program, project, or activity financed by this division to another federal agency not financed by this division without an explicit authorization of Congress.  (Sec. 8107) Prohibits funds provided by this division from being used to initiate or expand support for foreign forces, irregular forces, groups, or individuals supporting U.S. Special Operations Forces activities to combat terrorism unless Congress is notified in advance in accordance with the classified annex of this division.  (Sec. 8108) Prohibits funds provided by this division from being used for activities in Iraq in contravention of the War Powers Resolution.  (Sec. 8109) Prohibits funds provided by this division for the T-AO Fleet Oiler or the Towing, Salvage, and Rescue Ship programs from being used to award a new contract that provides for the acquisition of certain components unless the components are manufactured in the United States.  (Sec. 8110) Reduces the funds provided by title II this division to the Working Capital Funds to reflect excess cash balances.  (Sec. 8111) Reduces the total amount appropriated by this division to reflect savings due to lower than anticipated fuel prices.  (Sec. 8112) Prohibits funds provided by this division from being used for Government Travel Charge Card expenses for gaming or for entertainment that includes topless or nude entertainers or participants.  (Sec. 8113) Prohibits funds provided by this division from being used for a new or additional Base Realignment and Closure (BRAC) round.  (Sec. 8114) Permits specified Navy O&amp;M funds to be used for the National Defense Reserve Fleet and for reimbursements to the Ready Reserve Force, Maritime Administration account of the Department of Transportation for expenses related to the National Defense Reserve Fleet.  (Sec. 8115) Prohibits funds provided by this division for the Joint Surveillance Target Attack Radar System recapitalization program from being used for pre-milestone B activities after March 31, 2018, except for source selection and other activities necessary to enter the engineering and manufacturing development phase.  (Sec. 8116) Prohibits funds provided by this division from being used to close or realign the U.S. Naval Station, Guantanamo Bay, Cuba.  (Sec. 8117) Permits specified funds provided by this division to be used for activities related to the Zika virus.  (Sec. 8118) Prohibits funds provided by this division from being used for any computer network that does not block access to pornography websites, with exceptions for criminal investigations, prosecution, or adjudication activities; or for any activity necessary for the national defense, including intelligence activities.  (Sec. 8119) Specifies limitations on the transfer of funds provided by this division for the Global Engagement Center.  (Sec. 8120) Prohibits funds from being transferred from the Defense Acquisition Workforce Development Fund to the Rapid Prototyping Fund or credited to a military department-specific fund established to carry out an acquisition program under the rapid prototyping pathway.  (Sec. 8121) Provides additional funds for the military personnel accounts for the purpose of a military pay raise.  (Sec. 8122) Provides additional O&amp;M funds that are only available to DOD, or for transfer to the Department of Education, to make grants, conclude cooperative agreements, or supplement federal funds to construct, renovate, repair, or expand elementary and secondary public schools on military installations.  (Sec. 8123) Prohibits funds provided by this division from being used to carry out specified changes to the Joint Travel Regulations of the Department of Defense.  (Sec. 8124) Requires certain DOD programs that provide assisted reproductive services for seriously ill or injured active duty service members to be carried out without time limits on the duration of embryo cryopreservation and storage.  TITLE IX--OVERSEAS CONTINGENCY OPERATIONS/GLOBAL WAR ON TERRORISM  Provides appropriations for FY2018 for Overseas Contingency Operations (OCO)/ the Global War on Terrorism.  Designates the funds provided in this title as for Overseas Contingency Operations/ Global War on Terrorism pursuant to the Balanced Budget and Emergency Deficit Control Act of 1985. (OCO funds are exempt from discretionary spending limits and other budget enforcement rules.)  Provides appropriations for Active-Duty and Reserve Personnel in the Army, Navy, Marine Corps and Air Force (the military departments), and for National Guard personnel in the Army and Air Force.  Provides appropriations for the Military Personnel--National Defense Restoration Fund.  Provides appropriations for Operation and Maintenance (O&amp;M) for the military departments, other agencies of DOD, the Reserve Components, and the Army and Air National Guard.  Provides appropriations for the O&amp;M--National Defense Restoration Fund.  Provides appropriations for the Afghanistan Security Forces Fund and the Counter-Islamic State of Iraq and the Levant Train and Equip Fund.  Provides appropriations for Procurement by the military departments, other DOD agencies, Reserve Components, and National Guard, including procurement for aircraft, missiles, weapons, tracked combat vehicles, space, and ammunition.  Provides appropriations for: (1) the National Guard and Reserve Equipment Account, and (2) the Procurement-- National Defense Restoration Fund.  Provides appropriations for Research, Development, Test, and Evaluation (RDT&amp;E) for the military departments and other DOD agencies.  Provides appropriations for the RDT&amp;E, National Defense Restoration Fund.  Provides appropriations for the Defense Working Capital Funds.  Provides appropriations for Other DOD Programs, including:  the Defense Health Program,   Drug Interdiction and Counter-Drug Activities,  the Joint Improvised Threat Defeat Fund, and   the Office of the Inspector General.   (Sec. 9001) Specifies that funds made available in this title are in addition to amounts appropriated to DOD for FY2018.  (Sec. 9002) Permits DOD to transfer specified funds between the appropriations in this title if it is in the national interest, OMB approves, and Congress is notified.  (Sec. 9003) Permits supervision, administration, and design costs for a construction project funded with O&amp;M or the Afghanistan Security Forces Fund in direct support of overseas contingency operations in Afghanistan to be obligated when a construction contract is awarded.  (Sec. 9004) Permits DOD to use funds appropriated in this title to purchase motor vehicles for use by military and civilian DOD employees in the U.S. Central Command area of responsibility. Limits the cost of each passenger and armored vehicle.  (Sec. 9005) Permits specified Army O&amp;M funds to be used for the Commander's Emergency Response Program for humanitarian relief and reconstruction assistance in Afghanistan.  (Sec. 9006) Permits DOD O&amp;M funds to be used to provide supplies, services, transportation, including airlift and sealift, and other logistical support to allied forces participating in a combined operation with U.S. and coalition forces supporting military and stability operations in Afghanistan and to counter the Islamic State of Iraq and the Levant. Requires DOD to report quarterly to Congress regarding support provided under this section.  (Sec. 9007) Prohibits funds from being used to: (1) establish any military installation or base for providing for the permanent stationing of Armed Forces in Iraq or Afghanistan, or (2) exercise U.S. control over any oil resource of Iraq.  (Sec. 9008) Prohibits funds provided by this division from being used in contravention of specified laws or regulations implementing the United Nations Convention Against Torture and Other Cruel, Inhuman, or Degrading Treatment or Punishment.  (Sec. 9009) Prohibits funds provided for the Afghanistan Security Forces Fund from being obligated prior to the approval of a financial and activity plan by the Afghanistan Resources Oversight Council of DOD.  (Sec. 9010) Permits O&amp;M funds provided in this title to be used to purchase items with an investment unit cost of up to $250,000. Permits the purchase of items with an investment cost of up to $500,000 if DOD determines that it is necessary to meet the operational requirements of a Commander of a Combatant Command engaged in contingency operations overseas.  (Sec. 9011) Permits specified funds provided by this division for the Defense Security Cooperation Agency and Defense-Wide Operation and Maintenance to be used to provide assistance to the government of Jordan to support the armed forces of Jordan and to enhance security along its borders.  (Sec. 9012) Prohibits funds provided by this division for the Counter-ISIL Train and Equip Fund from being used to procure or transfer man-portable air defense systems.  (Sec. 9013) Provides additional funding for assistance and sustainment of the military and national security forces of Ukraine.  (Sec. 9014) Permits funds provided by this title to be used for the replacement of funds for items provided to the government of Ukraine from the U.S. inventory.  (Sec. 9015) Prohibits funds provided by this division under section 9013 for Assistance and Sustainment to the Military and National Security Forces of Ukraine from being used to procure or transfer man-portable air defense systems.  (Sec. 9016) Prohibits DOD O&amp;M funds from being used for payments to Pakistan as reimbursement for support provided to U.S. military operations unless DOD certifies to Congress that the government of Pakistan has met specific conditions. Permits DOD to waive the restriction for national security.  (Sec. 9017) Provides additional funding to DOD to improve intelligence, surveillance, and reconnaissance capabilities.  (Sec. 9018) Prohibits the use of funds for Syria in contravention of the War Powers Resolution.  (Sec. 9019) Rescinds specified funds provided by DOD appropriations bills for:    Other Procurement, Air Force;   the Afghanistan Security Forces Fund;   the Counter-ISIL Train and Equip Fund, and   Operation and Maintenance, Defense-Wide, DSCA Coalition Support Fund.   (Sec. 9020) Specifies that amounts designated by this division for Overseas Contingency Operations/Global War on Terrorism are only available if the President subsequently designates the amounts and transmits the designations to Congress.  (Sec. 9021) Requires the President to submit to Congress a report on the U.S. strategy to defeat Al-Qaeda, the Taliban, the Islamic State of Iraq and Syria (ISIS), and their associated forces and co-belligerents. Requires the Secretary of State and the Secretary of Defense to testify at specified congressional hearings regarding the report.  TITLE X--ADDITIONAL GENERAL PROVISIONS  (Sec. 10001) Specifies that, unless this bill expressly provides otherwise, references to \"this Act\" included in this division shall be treated as referring only to the provisions of this division.  (Sec. 10002) Specifies the committee report that applies for the purpose of implementing this division.  (Sec. 10003) Establishes a spending reduction account for the amount by which spending proposed in this division exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0.  (Sec. 10004) Prohibits funds provided by this division for the Afghanistan Security Forces Fund from being used to procure uniforms for the Afghan National Army.  (Sec. 10005) Prohibits funds provided by this division from being used for the closure of a biosafety level 4 laboratory.  (Sec. 10006) Prohibits funds provided by this division from being used to provide arms, training, or other assistance to the Azov Battalion.  (Sec. 10007) Prohibits funds provided by this division from being used to purchase heavy water from Iran.  (Sec. 10008) Prohibits funds provided by this division from being used to plan for, begin, continue, complete, process, or approve a public-private competition under the Office of Management and Budget Circular A-76.  Legislative Branch Appropriations Act, 2018  DIVISION B--LEGISLATIVE BRANCH APPROPRIATIONS ACT, 2018  This division provides FY2018 appropriations for the legislative branch, including the House of Representatives and Joint Items such as: the Joint Economic Committee, the Joint Committee on Taxation (JCT), and the Office of the Attending Physician.  It also provides appropriations for:    the Capitol Police,   the Congressional Budget Office (CBO),   the Architect of the Capitol (AOC),   the Library of Congress (LOC),   the Government Publishing Office (GPO),   the Government Accountability Office (GAO), and   the Open World Leadership Center.   Pursuant to a longstanding practice under which each chamber of Congress determines its own requirements, the House bill does not include funds for the Senate.  TITLE I--LEGISLATIVE BRANCH  Provides appropriations to the House of Representatives for:    Salaries and Expenses;   House Leadership Offices;   Members' Representational Allowances, including Members' Clerk Hire, Official Expenses of Members, and Official Mail;   Committee Employees;   Salaries, Officers, and Employees; and   Allowances and Expenses.   (In this division, the term \"Member of the House of Representatives\" also includes a Delegate or Resident Commissioner to the Congress.)  (Sec. 101) Requires amounts remaining in Members' Representational Allowances after all payments are made for FY2018 to be used for deficit or debt reduction.  (Sec. 102) Prohibits funds provided by this division from being used to deliver a printed copy of a bill, joint resolution, or resolution to the office of a Member of the House of Representatives unless the Member requests a copy.  (Sec. 103) Prohibits funds provided by this division from being used to deliver a printed copy of the Congressional Record to the office of a Member of the House of Representatives.  (Sec. 104) Prohibits funds provided by this division from being used to make payments from any Members' Representational Allowance to lease a vehicle, excluding mobile district offices, at a rate that exceeds $1,000 for the vehicle in any month.  (Sec. 105) Prohibits funds provided by this division from being used to provide an aggregate number of more than 50 printed copies of any edition of the U.S. Code to all offices of the House of Representatives.  (Sec. 106) Prohibits funds provided by this division from being used to deliver a printed copy of the report of disbursements for the operations of the House of Representatives to the office of a Member of the House of Representatives.  (Sec. 107) Prohibits funds provided by this division from being used to deliver to the office of a Member of the House Representatives a printed copy of the Daily Calendar of the House of Representatives prepared by the Clerk of the House of Representatives.  (Sec. 108) Prohibits funds provided by this division from being used to deliver a printed copy of the Congressional Pictorial Directory to the office of a Member of the House of Representatives.  (Sec. 109) Amends the Legislative Branch Appropriations Act, 2005 to include in the House Services Revolving Fund service fees that are collected from vendors of the Master Web Services Agreement or the Technology Services Contract for failing to abide by and maintain House of Representatives security policies.  (Sec. 110) Prohibits cost of living adjustments for Members of Congress during FY2018.  Provides appropriations for Joint Items, including:    the Joint Economic Committee,   the Joint Committee on Taxation,   the Office of the Attending Physician, and   the Office of Congressional Accessibility Services.   (Sec. 1001) Establishes senior level Joint Committee on Taxation positions to meet critical scientific, technical, professional, or executive needs and limits the compensation for the positions to level II of the Executive Schedule.  Provides appropriations for:    the Capitol Police,   the Office of Compliance, and   the Congressional Budget Office (CBO).   Provides appropriations to the Architect of the Capitol (AOC) for:    Capital Construction and Operations;   the Capitol Building;   the Capitol Grounds;   the House Office Buildings;   the Capitol Power Plant;   the Library Buildings and Grounds;   the Capitol Police Buildings, Grounds and Security;   the Botanic Garden; and  the Capitol Visitor Center.   (Sec. 1101) Prohibits funds provided by this division for the AOC from being used to make incentive or award payments to contractors for work that is behind schedule or over budget, unless the deviations are due to unforeseeable events, government-driven scope changes, or are insignificant within the overall scope of the project or program.  (Sec. 1102) Prohibits funds provided by this division from being used for scrims (coverings for buildings that are being renovated) containing photographs of building facades during restoration or construction projects performed by the AOC.  Provides appropriations to the Library of Congress (LOC) for:    Salaries and Expenses,   the Copyright Office,   the Congressional Research Service, and   Books for the Blind and Physically Handicapped.   (Sec. 1201) Limits the FY2018 obligational authority of the LOC for reimbursable and revolving fund activities funded from sources other than appropriations.  Provides appropriations to the Government Publishing Office for:    Congressional Publishing,   Public Information Programs of the Superintendent of Documents, and   the Government Publishing Office Business Operations Revolving Fund.   Provides appropriations to:    the Government Accountability Office,   the Open World Leadership Center Trust Fund, and   the John C. Stennis Center for Public Service Training and Development.   TITLE II--GENERAL PROVISIONS  (Sec. 201) Prohibits funds provided by this division from being used for the maintenance or care of private vehicles, except for emergency assistance and cleaning.  (Sec. 202) Prohibits funds provided by this division from remaining available for obligation beyond FY2018 unless expressly provided in this division.  (Sec. 203) Provides that: (1) rates of compensation or designations of offices or positions included in this division that are either not established by the Legislative Pay Act of 1929 or are contrary to that Act are considered permanent law, and (2) provisions in this division for official congressional expenses and clerk hire for Senators and Members of the House of Representatives are permanent law.  (Sec. 204) Limits contracts for certain consulting services to those where expenditures are a matter of public record and available for public inspection.  (Sec. 205) Permits legislative branch entities participating in the Legislative Branch Financial Managers Council to use funds provided for administrative expenses to pay a share of the cost of the council if the total cost shared among all participating entities does not exceed $2,000.  (Sec. 206) Prohibits funds provided by this division from being transferred to any department, agency, or instrumentality of the U.S. government unless the transfer is pursuant to authority provided by an appropriations Act.  (Sec. 207) Prohibits the AOC from using funds provided by this division to eliminate or restrict guided Capitol tours led by congressional employees and interns, subject to an exception permitting tours to be suspended for security or related reasons.  (Sec. 208) Specifies that, unless this bill expressly provides otherwise, references to \"this Act\" included in this division shall be treated as referring only to the provisions of this division.  (Sec. 209) Specifies the committee report that applies for the purpose of implementing this division.  (Sec. 210) Establishes a spending reduction account for the amount by which spending proposed in this division exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0.  (Sec. 211) Prohibits funds provided by this division from being used to deliver a printed copy of the Federal Register to the office of a Member of the House of Representatives unless a printed copy is requested by the Member.  Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2018  DIVISION C--MILITARY CONSTRUCTION, VETERANS AFFAIRS, AND RELATED AGENCIES APPROPRIATIONS ACT, 2018  This division provides FY2018 appropriations to the Department of Defense (DOD) for military construction, military family housing, the U.S. share of the North Atlantic Treaty Organization Security Investment Program, and base closures and realignments.  The division also provides appropriations to the Department of Veterans Affairs (VA) for veterans benefit and health care programs, Departmental Administration, and the National Cemetery Administration.  Related agencies and programs funded in the division include the U.S. Court of Appeals for Veterans Claims; the Armed Forces Retirement Home; and the Cemeterial Expenses of the Army, including Arlington National Cemetery.  The division also includes Army, Air Force, Navy and Marine Corps, Air Force, and Defense-Wide military construction funds which are designated as Overseas Contingency Operations (OCO) funds and are not subject to discretionary spending limits.  TITLE I--DEPARTMENT OF DEFENSE  Provides appropriations to the Department of Defense (DOD) for Military Construction for:    the Army;   the Navy and Marine Corps;   the Air Force;   Defense-Wide agencies and activities (other than military departments);   the Army and Air National Guard; and   the Army, Navy, and Air Force Reserves.   Provides appropriations to DOD for the North Atlantic Treaty Organization (NATO) Security Investment Program.  Provides appropriations to DOD for Construction and Operation and Maintenance of Family Housing for:    the Army,   the Navy and Marine Corps,   the Air Force, and   Defense-Wide agencies and activities (other than military departments).   Provides appropriations for the DOD Family Housing Improvement Fund and the DOD Military Unaccompanied Housing Improvement Fund.  Provides appropriations for the DOD Base Closure Account.  (Sec. 101) Prohibits funds provided by this title from being used for payments exceeding $25,000 for construction in the United States under a cost-plus-a-fixed-fee contract without a specific DOD approval in writing. Includes an exception for work that is to be performed in Alaska.  (Sec. 102) Permits construction funds provided by this title to be used for hiring passenger motor vehicles.  (Sec. 103) Permits construction funds provided by this title to be used for advances to the Federal Highway Administration for the construction of access roads DOD has certified as important to national defense.  (Sec. 104) Prohibits funds provided by this title from being used to begin construction of new bases in the United States without a specific appropriation.  (Sec. 105) Prohibits funds provided by this title from being used to purchase land or land easements in excess of 100% of the value as determined by the Army Corps of Engineers or the Naval Facilities Engineering Command. Includes exceptions for: (1) determinations of value by a federal court, (2) purchases negotiated by the Attorney General or a designee, (3) values less than $25,000, and (4) DOD determinations that the purchase is in the public interest.  (Sec. 106) Prohibits funds provided by this title from being used to acquire land, provide for site preparation, or install utilities for family housing, except housing for which appropriations have been provided.  (Sec. 107) Prohibits funds provided by this title for minor construction from being used to transfer or relocate any activity from one base or installation to another without notifying Congress in advance.  (Sec. 108) Prohibits funds provided by this title from being used to procure steel for construction unless American producers, fabricators, and manufacturers have been allowed to compete for the procurement.  (Sec. 109) Prohibits funds provided to DOD for military construction or family housing during the current fiscal year from being used to pay real property taxes in any foreign nation.  (Sec. 110) Prohibits funds provided by this title from being used to initiate a new installation overseas without notifying Congress in advance.  (Sec. 111) Prohibits funds provided by this title from being used for architect and engineer contracts estimated to exceed $500,000 for projects in Japan, NATO member countries, or countries bordering the Arabian Gulf unless the contracts are awarded to U.S. firms or joint ventures with U.S. firms and host nation firms.  (Sec. 112) Prohibits funds provided by this title for military construction in U.S. territories and possessions in the Pacific and on Kwajalein Atoll, or in countries bordering the Arabian Gulf from being used to award a contract over $1 million to a foreign contractor. Includes exceptions.  (Sec. 113) Requires DOD to notify Congress in advance of military exercises if construction costs are expected to exceed $100,000.  (Sec. 114) Permits funds appropriated to DOD for construction in prior years to be used for construction projects authorized during the current session of Congress.  (Sec. 115) Permits expired or lapsed funds to be used to pay for supervision, inspection, overhead, engineering, and design costs for military construction or family housing projects being completed with lapsed or expired funds.  (Sec. 116) Permits funds provided for the construction of military projects to be available for five years if: (1) the funds are obligated from funds available for military construction, and (2) do not exceed the amount appropriated or permitted by law.  (Sec. 117) Permits the following transfers if Congress is notified and specified conditions are met:    to the DOD Family Housing Improvement Fund from appropriations for construction in Family Housing accounts, and   to the DOD Military Unaccompanied Housing Improvement Fund from appropriations for construction of military unaccompanied housing in Military Construction accounts.   (Sec. 118) Permits the transfer of funds from the DOD Base Closure Account to the fund established to pay expenses associated with the Homeowners Assistance Program under the Demonstration Cities and Metropolitan Development Act of 1966.  (Sec. 119) Provides that funds for operation and maintenance of family housing in this title shall be the only source of funds for repair and maintenance of all family housing units, including general or flag officer quarters. Sets forth limitations and requirements for expenditures for maintenance and repair of general or flag officer quarters.  (Sec. 120) Appropriates funds contained in the Ford Island Improvement Account to remain available until expended or transferred.  (Sec. 121) Permits the transfer of unobligated balances of expired military construction and family housing funds into the Foreign Currency Fluctuations--Construction--Defense account.  (Sec. 122) Prohibits the Army from using funds provided by this division to relocate a unit that: (1) performs a required testing mission or function not performed by any other unit, and (2) is located at a military installation where the total number of Army civilian employees and contractor personnel exceeds 10% of the regular and reserve Army personnel. Includes an exception if the Army notifies Congress of the relocation's compliance with Army Regulation 5-10 concerning stationing actions.  (Sec. 123) Permits funds provided to an account in this title to be transferred among projects and activities within the account subject to specified DOD reprogramming guidelines for military and family housing construction.  (Sec. 124) Prohibits DOD military construction funds provided in this title from being used for the planning, design, and construction of projects at Arlington National Cemetery.  (Sec. 125) Provides specified additional funds to remain available through FY2022 for unfunded military construction priorities.  (Sec. 126) Rescinds specified unobligated balances from Military Construction, Family Housing Construction, and the North Atlantic Treaty Organization Security Investment Program accounts.  (Sec. 127) Defines \"congressional defense committees\" to include the House and Senate Armed Services Committees and Appropriations Subcommittees on Military Construction and Veterans Affairs.  (Sec. 128) Prohibits funds provided by this division from being used for the closure or realignment of the U.S. Naval Station, Guantanamo Bay, Cuba.  TITLE II--DEPARTMENT OF VETERANS AFFAIRS  Provides appropriations to the Veterans Benefits Administration (VBA) for:    Compensation and Pensions,   Readjustment Benefits,   Veterans Insurance and Indemnities,   the Veterans Housing Benefit Program Fund,   the Vocational Rehabilitation Loans Program Account,   the Native American Veteran Housing Loan Program Account, and   General Operating Expenses.   Provides appropriations to the Veterans Health Administration (VHA) for:    Medical Services,   Medical Community Care,   Medical Support and Compliance,   Medical Facilities, and   Medical and Prosthetic Research.   Provides appropriations to the National Cemetery Administration.  Provides appropriations to the VA for Departmental Administration, including:    General Administration,   the Board of Veterans Appeals,   Information Technology Systems,   the Office of Inspector General,   Construction--Major Projects,   Construction--Minor Projects,   Grants for Construction of State Extended Care Facilities, and   Grants for Construction of Veterans Cemeteries.   Prohibits more than 25% of the funds provided for information technology systems development, modernization, and enhancement from being used for development of an electronic health record until the VA submits a report to Congress that includes specified details regarding the development of an electronic health records system.  Withholds specified VHA construction funds until the VA:    enters an agreement with a non-VA federal entity to serve as the design and/ or construction agent for any VHA major construction project that exceeds $100 million, and   certifies that an agreement is executed to minimize or prevent subsequent major construction project cost overruns.   (Sec. 201) Specifies transfer authorities and requirements for the VBA.  (Sec. 202) Specifies transfer authorities and requirements for the VHA.  (Sec. 203) Permits appropriations for salaries and expenses to be used for employment of temporary or intermittent experts and consultants, hire of passenger vehicles, lease of a facility or land or both, and uniforms.  (Sec. 204) Prohibits appropriations in this title other than Construction--Major Projects and Construction--Minor Projects from being used for land acquisition or construction of any new hospital or home.  (Sec. 205) Requires the VA to be reimbursed for medical services it provides to any person not defined as a beneficiary under specified laws.  (Sec. 206) Permits appropriations provided by this title for Compensation and Pensions, Readjustment Benefits, and Veterans Insurance and Indemnities to be used for payment of accrued obligations for the accounts recorded in the last quarter of FY2017.  (Sec. 207) Permits appropriations provided by this title to be used to pay specified prior year obligations. Requires obligations from trust fund accounts to be paid only from the Compensation and Pensions account.  (Sec. 208) Requires the VA to use surplus earnings from the National Service Life Insurance Fund, the Veterans' Special Life Insurance Fund, and the United States Government Life Insurance Fund to reimburse the General Operating Expenses--Veterans Benefits Administration and Information Technology Systems accounts for the costs to administer the insurance programs during FY2018.  (Sec. 209) Permits amounts deducted from enhanced-use lease proceeds for reimbursement of expenses from a prior year to be obligated in the year in which the proceeds are received.  (Sec. 210) Permits funds provided by this title for salaries and other administrative expenses to be used to reimburse the following offices, subject to specified limits:    the Office of Resolution Management,   the Office of Employment Discrimination Complaint Adjudication,   the Office of Accountability Review,   the Central Whistleblower Office,   the Office of Diversity and Inclusion, and   the Office of the Executive Director of Accountability and Whistleblower Protection.   (Sec. 211) Requires the VA to collect third-party reimbursement information prior to providing hospital care, nursing home care, or medical services for a non-service connected disability. Permits the VA to recover reasonable charges for care from anyone who has not provided the required disclosures.  (Sec. 212) Permits enhanced-use leasing revenues to be deposited into the Construction--Major Projects and Construction--Minor Projects accounts to be used for construction, alterations, and improvements of VA medical facilities.  (Sec. 213) Permits funds provided for Medical Services to be used for: (1) furnishing recreational facilities, supplies, and equipment; and (2) funeral and burial expenses.  (Sec. 214) Permits funds deposited in the Medical Care Collections Fund to be transferred to the Medical Services and Medical Community Care accounts and remain available until expended for the purposes of those accounts.  (Sec. 215) Permits the VA to enter into agreements with Federally Qualified Health Centers in Alaska and Indian tribes and tribal organizations which are party to the Alaska Native Health Compact with the Indian Health Service to provide healthcare, including behavioral health and dental care, to veterans in rural Alaska. Defines \"rural Alaska\" as those lands which are not within the boundaries of the municipality of Anchorage or the Fairbanks North Star Borough.  (Sec. 216) Permits funds deposited into the Department of Veterans Affairs Capital Asset Fund to be transferred to the Construction--Major Projects and Construction--Minor Projects accounts to remain available until expended.  (Sec. 217) Requires the VA to report quarterly to Congress on the financial status of the VA.  (Sec. 218) Permits specified FY2018 VA funds to be transferred to or from the Information Technology Systems account if approved by Congress.  (Sec. 219) Permits specified FY2018 VA funds provided for medical accounts, Construction--Minor Projects, and Information Technology Systems to be transferred to the Joint Department of Defense-Department of Veterans Affairs Medical Facility Demonstration Fund and used for the operation of combined federal medical facilities.  (Sec. 220) Permits specified FY2019 VA advance funding provided for medical accounts to be transferred to the Joint Department of Defense-Department of Veterans Affairs Medical Facility Demonstration Fund and used for the operation of combined federal medical facilities.  (Sec. 221) Permits transfers from the Medical Care Collections Fund to the Joint Department of Defense-Department of Veterans Affairs Medical Facility Demonstration Fund for the operation of combined federal medical facilities.  (Sec. 222) Requires specified funds from the Medical Services, Medical Support and Compliance, and Medical Facilities accounts to be transferred to the DOD-VA Health Care Sharing Incentive Fund to remain available until expended.  (Sec. 223) Prohibits the VA from using funds to replace the current system that the Veterans Integrated Service Networks use to select and contract for diabetes monitoring supplies and equipment.  (Sec. 224) Directs the VA to notify Congress of all bid savings in major construction projects that total at least $5 million or 5% of the programmed amount of the project, whichever is less.  (Sec. 225) Prohibits the scope of work for a project included in Construction--Major Projects from being increased above the original budget request without congressional approval.  (Sec. 226) Requires the VA to submit to Congress a quarterly report containing performance measures and data from each VBA regional office.  (Sec. 227) Provides specified funds from the Medical Services and Medical Support and Compliance accounts to develop an electronic health record. Limits the funds that may be spent for this purpose until the VA submits to Congress a specified report regarding activities to develop the Military Health System Genesis electronic health record.  (Sec. 228) Directs the VA to notify Congress before organizational changes that result in the transfer of 25 or more full-time equivalent staff from one organizational unit to another.  (Sec. 229) Requires the VA to report to Congress quarterly regarding any single national outreach and awareness marketing campaign exceeding $2 million.  (Sec. 230) Permits the VA to transfer funds to the Medical Services account if the transfer is necessary to address the needs of the VHA, meets specified requirements, and is approved by the Office of Management and Budget and Congress.  (Sec. 231) Permits FY2018 funds provided for the Board of Veterans Appeals and General Operating Expenses--Veterans Benefits Administration to be transferred between those accounts if Congress approves the transfer.  (Sec. 232) Prohibits the VA from reprogramming more than $5 million in funds among major construction projects or programs without congressional approval.  (Sec. 233) Rescinds specified unobligated balances from the VA Medical Services, Medical Support and Compliance, and Medical Facilities accounts.  (Sec. 234) Rescinds specified unobligated balances of funds provided to the VA.  (Sec. 235) Requires the VA to ensure that the toll-free suicide hotline authorized under current law: (1) provides individuals who contact the hotline with immediate assistance from a trained professional, and (2) adheres to all requirements of the American Association of Suicidology.  Prohibits funds provided by this division from being used to enforce or otherwise carry out any executive action that prohibits the VA from appointing an individual to occupy a vacant civil service position, or establishing a new civil service position, with respect to the hotline.  (Sec. 236) Prohibits funds from being used to close or diminish services at certain VA medical facilities until the VA submits to Congress a national realignment strategy.  (Sec. 237) Permits the VA to use a passenger carrier to transport employees between a parking facility and the VA medical facility where the employee works.  (Sec. 238) Requires the VA to use the breast cancer screening guidelines issued on May 10, 2017, by the Veterans Health Administration National Center for Health Promotion and Disease Prevention.  (Sec. 239) Permits VA Medical Services funds to be used to provide: (1) fertility counseling and treatment using assisted reproductive technology to a covered veteran or the spouse of a covered veteran, or (2) adoption reimbursement to a covered veteran. Defines a \"covered veteran\" as a veteran who has a service-connected disability that results in the inability of the veteran to procreate without the use of fertility treatment.  TITLE III--RELATED AGENCIES  Provides appropriations for related agencies, including:    the American Battle Monuments Commission;   the U.S. Court of Appeals for Veterans Claims;   Cemeterial Expenses of the Army, including Arlington National Cemetery and Soldiers' and Airmen's Home National Cemetery; and   the Armed Forces Retirement Home.   (Sec. 301) Permits funds for Cemeterial Expenses--Army to be provided to Arlington County, Virginia, to relocate a federally owned water main at Arlington National Cemetery to make additional land available for ground burials.  (Sec. 302) Permits funds from concessions at Army National Military Cemeteries to be used to support activities at the cemeteries.  TITLE IV--OVERSEAS CONTINGENCY OPERATIONS  Provide appropriations to DOD for Overseas Contingency Operations Military Construction projects for the:    Army,   Navy and Marine Corps,   Air Force, and   Defense-Wide agencies and activities.   Designates the amounts provided in this title as for Overseas Contingency Operations/ Global War on Terrorism pursuant to the Balanced Budget and Emergency Deficit Control Act of 1985.  (Sec. 401) Specifies that funds designated in this division by Congress for Overseas Contingency Operations/Global War on Terrorism are only available if the President subsequently designates the amounts and transmits the designations to Congress.  TITLE V--GENERAL PROVISIONS  (Sec. 501) Prohibits the obligation of funds in this division beyond the current fiscal year unless expressly permitted in this division.  (Sec. 502) Prohibits the use of funds provided by this division for programs, projects, or activities not in compliance with federal laws related to risk assessment, the protection of private property rights, or unfunded mandates.  (Sec. 503) Encourages all departments and agencies funded in this division to expand their use of \"E-Commerce\" technologies and procedures.  (Sec. 504) Specifies the congressional committees that are to receive all reports and notifications required by this division.  (Sec. 505) Prohibits the transfer of funds to any part of the U.S. government without authority provided by an appropriations law.  (Sec. 506) Prohibits funds provided by this division from being used for a project or program named for an individual serving as a Member, Delegate, or Resident Commissioner of the U.S. House of Representatives.  (Sec. 507) Requires agencies to post reports submitted to Congress on the public website of the agency. Includes exceptions for national security and confidential or proprietary information.  (Sec. 508) Prohibits the use of funds provided by this division for a computer network unless pornography is blocked, with the exception of law enforcement, prosecution, or adjudication activities.  (Sec. 509) Prohibits the use of funds provided by this division for first-class travel by an employee of the executive branch.  (Sec. 510) Prohibits the use of funds provided by this division for any contract where the contractor has not complied with E-Verify requirements for verification of eligibility for employment.  (Sec. 511) Prohibits DOD or the VA from using funds provided by this division to purchase or lease a new vehicle except in accordance with Presidential Memorandum--Federal Fleet Performance, dated May 24, 2011.  (Sec. 512) Prohibits the use of funds provided by this division for the renovation, expansion, or construction of any facility in the United States to house any individual detained at the U.S. Naval Station at Guantanamo Bay, Cuba, for the purposes of detention or imprisonment in the custody or under the control of DOD. Includes an exception for modification to the facility at Guantanamo Bay.  (Sec. 513) Specifies that, unless this bill expressly provides otherwise, references to \"this Act\" included in this division shall be treated as referring only to the provisions of this division.  (Sec. 514) Specifies the committee report that applies for the purpose of implementing this division.  (Sec. 515) Establishes a spending reduction account for the amount by which spending proposed in this division exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0.  (Sec. 516) Reduces the funding provided by this division for Department of Veterans Affairs--Departmental Administration--Information Technology Services (and the amount specified for operations and maintenance) and increases the funds provided by this division for Veterans Health Administration--Medical Services.  (Sec. 517) Prohibits the VA from using funds provided by this division in contravention of requirements for training and outreach programs for homeless veterans.  (Sec. 518) Prohibits funds provided by this division from being used to charge a veteran a fee for a veterans identification card if the veteran uses a specified form to apply for the card and indicates on the form that the veteran is homeless.  (Sec. 519) Prohibits funds provided by this division from being used for a new or additional Base Realignment and Closure (BRAC) round.  (Sec. 520) Prohibits the VA from using funds provided by this division to purchase, breed, transport, house, feed, maintain, dispose of, or experiment on dogs as part of any study assigned to certain pain categories defined by the Department of Agriculture. Includes an exception for training programs or studies of service dogs.  Energy and Water Development and Related Agencies Appropriations Act, 2018  DIVISION D--ENERGY AND WATER DEVELOPMENT AND RELATED AGENCIES APPROPRIATIONS ACT, 2018  This division provides FY2018 appropriations for:    the civil works projects of the U.S. Army Corps of Engineers;   the Department of the Interior's Bureau of Reclamation and Central Utah Project;   the Department of Energy (DOE); and   several independent agencies, including the Nuclear Regulatory Commission.   TITLE I--CORPS OF ENGINEERS--CIVIL  Provides appropriations to the U.S. Army Corps of Engineers for authorized civil functions pertaining to rivers and harbors, flood and storm damage reduction, shore protection, aquatic ecosystem restoration, and related efforts.  Provides appropriations to the Corps of Engineers for:    Investigations;  Construction;   Mississippi River and Tributaries, including flood damage reduction projects in the Mississippi River alluvial valley below Cape Girardeau, Missouri;   Operation and Maintenance;  the Regulatory Program pertaining to navigable waters and wetlands;   the Formerly Utilized Sites Remedial Action Program for clean-up of early atomic energy program contamination;   Flood Control and Coastal Emergencies, including hurricanes, floods, and other natural disasters;   Expenses, necessary for the supervision and general administration of the civil works program; and   the Office of the Assistant Secretary of the Army for Civil Works.   (Sec. 101) Prohibits the reprogramming of funds provided by this title except in specified circumstances.  (Sec. 102) Prohibits funds provided by this title from being used for a contract that commits funds beyond the amounts appropriated for that program, project, or activity that remain unobligated. Includes exception for funds made available through reprogramming.  (Sec. 103) Permits the Corps of Engineers to transfer to the U.S. Fish and Wildlife Service up to $5.4 million in Operation and Maintenance funds to mitigate for fisheries lost due to Corps of Engineers projects.  (Sec. 104) Prohibits funds provided by this division from being used for an open lake placement of dredged material originating from Lake Erie or its tributaries unless it is approved under a state water quality certification. Requires the Corps to continue upland placement of the dredged material until an open lake placement for dredged materials is approved under a state water quality certification.  (Sec. 105) Requires acquisitions funded by this title to comply with regulations that prohibit the Department of Defense from purchasing a certain anchor and mooring chain unless it is procured from a U.S. manufacturer.  (Sec. 106) Prohibits funds provided by this division from being used for a water supply reallocation study under the Wolf Creek Dam, Lake Cumberland, Kentucky, project authorized under the Act of July 24, 1946.  (Sec. 107) Prohibits funds made available by this division from being used to require a permit for the discharge of dredged or fill material under Federal Water Pollution Control Act (commonly known as the Clean Water Act) for specified agricultural activities.  (Sec. 108) Authorizes the Environmental Protection Agency and the Army Corps of Engineers to withdraw the Waters of the United States rule without regard to any provision of statute or regulation that establishes a requirement for withdrawal. (This provision applies to the final rule issued by the two agencies on June 29, 2015, and titled \"Clean Water Rule: Definition of 'Waters of the United States.'\" The rule revised regulations defining the scope of waters protected and regulated under the Clean Water Act.)  (Sec. 109) Permits individuals to possess firearms at Corps of Engineers water resources development projects if: (1) the individual is not otherwise prohibited by law from possessing the firearm, and (2) the possession of the firearm complies with the law of the state in which the project is located. (The Corps of Engineers currently prohibits private individuals from possessing firearms and other weapons at the projects unless the weapons are being used for hunting, at authorized shooting ranges, or with written permission of the Corps District Commander.)  TITLE II--DEPARTMENT OF THE INTERIOR  Provides appropriations to the Department of the Interior for the Central Utah Project.  Provides appropriations to the Bureau of Reclamation for:    Water and Related Resources,   the Central Valley Project Restoration Fund,   California Bay-Delta Restoration, and   Policy and Administration.   Permits appropriations to the Bureau of Reclamation to be used for purchasing replacements for up to five passenger motor vehicles.  (Sec. 201) Specifies the circumstances in which Reclamation may reprogram or transfer funds provided by this title.  (Sec. 202) Prohibits funds provided by this division from being used to determine the final point of discharge for the interceptor drain for the San Luis Unit until Interior and California develop a plan to minimize any detrimental effect of the San Luis drainage waters. Requires the plan to conform to California water quality standards as approved by the Environmental Protection Agency.  Directs Interior to classify the costs of the Kesterson Reservoir Cleanup Program and the San Joaquin Valley Drainage Program as either reimbursable or nonreimbursable and collected until fully repaid pursuant to specified alternative repayment plans.  Requires future federal obligations of funds regarding drainage service or drainage studies for the San Luis Unit to be fully reimbursable by San Luis Unit beneficiaries of the service or studies.  (Sec. 203) Prohibits funds provided by this division from being used to implement the San Joaquin River Restoration Settlement Agreement.  TITLE III--DEPARTMENT OF ENERGY  Provides appropriations to the Department of Energy (DOE) for Energy Programs, including:    Energy Efficiency and Renewable Energy,   Electricity Delivery and Energy Reliability,   Nuclear Energy,   Fossil Energy Research and Development,   Naval Petroleum and Oil Shale Reserves,   the Strategic Petroleum Reserve,   the Northeast Home Heating Oil Reserve,   the Energy Information Administration,   Non-Defense Environmental Cleanup,   the Uranium Enrichment Decontamination and Decommissioning Fund,   Science,   Nuclear Waste Disposal,   the Title 17 Innovative Technology Loan Guarantee Loan Program,   the Advanced Technology Vehicles Manufacturing Loan Program,   the Tribal Energy Loan Guarantee Program,   Departmental Administration, and   the Office of the Inspector General.   Provides appropriations for the Atomic Energy Defense Activities of the National Nuclear Security Administration (NNSA), including:    Weapons Activities,   Defense Nuclear Nonproliferation,   Naval Reactors, and   Federal Salaries and Expenses.   Provides appropriations for Environmental and Other Defense Activities, including:    Defense Environmental Cleanup,   Other Defense Activities, and   Defense Nuclear Waste Disposal.   Provides appropriations for the Power Marketing Administrations, including:    the Bonneville Power Administration Fund;   Southeastern Power Administration Operation and Maintenance;   Southwestern Power Administration Operation and Maintenance;   Western Area Power Administration Operation and Maintenance, Construction, and Rehabilitation; and   the Falcon and Amistad Operating and Maintenance Fund.   Provides appropriations for the Federal Energy Regulatory Commission.  (Sec. 301) Prohibits funds provided by this title from be used for programs, projects, or activities that have not been funded by Congress.  Prohibits specified grants, contracts, allocations, and agreements unless Congress is notified in advance.  Prohibits funds from being used for certain multiyear Department of Energy--Energy Programs activities unless specified conditions are met and Congress is notified.  Establishes requirements and restrictions for the reprogramming of funds provided in this title.  Permits unexpended balances of prior appropriations provided for activities in this division to be transferred and merged with appropriations accounts established in this division.  (Sec. 302) Deems funds appropriated by this division for intelligence activities to be specifically authorized by Congress during FY2018 until the enactment of the Intelligence Authorization Act for FY2018.  (Sec. 303) Prohibits funds provided by this title from being used to construct specified high-hazard nuclear facilities unless independent oversight is conducted by the Office of Independent Enterprise Assessments to ensure compliance with nuclear safety requirements.  (Sec. 304) Prohibits funds provided by this title from being used to approve certain critical decisions for construction projects exceeding $100 million until a separate independent cost estimate has been developed.  (Sec. 305) Prohibits Defense Nuclear Nonproliferation funds from being used for contracts with or agreements for federal assistance to the Russian Federation. Permits DOE to waive the prohibition if the activity is in the national security interests of the United States and a report justifying the waiver is submitted to Congress.  (Sec. 306) Authorizes DOE to draw down and sell refined petroleum product from the Strategic Petroleum Reserve (SPR) upon a determination by the President in this fiscal year that:    a regional supply shortage of refined petroleum product of significant scope and duration exists,   a severe increase in the price of refined petroleum product will likely result from the shortage, and   a draw down and sale of refined petroleum product would assist directly and significantly in reducing the adverse impact of the shortage.   Specifies that the proceeds from the sale must be deposited into the SPR Petroleum Account and remain available for obligation without fiscal year limitation, consistent with the Energy Policy and Conservation Act.  (Sec. 307) Requires DOE to drawdown and sell up to $8.4 million of crude oil from the SPR during this fiscal year (in addition to sales authorized under the Bipartisan Budget Act of 2015). Requires the proceeds from the sale to be deposited into the SPR Petroleum Account to remain available until expended for: (1) the costs of crude oil sales authorized under the Bipartisan Budget Act of 2015, and (2) specified provisions of the 21st Century Cures Act.  Prohibits DOE from drawing down and selling crude oil under this section in amounts that would limit the authority to sell petroleum products under the Energy Policy and Conservation Act in order to prevent or reduce adverse impacts of severe domestic energy supply interruptions.  (Sec. 308) Prohibits DOE from establishing any new regional petroleum product reserve unless funding is explicitly requested in advance and approved by Congress in an appropriations Act.  (Sec. 309) Limits the amount of funds provided by this title that may be transferred to the working capital fund established under the Department of Energy Organization Act.  TITLE IV--INDEPENDENT AGENCIES  Provides appropriations for independent agencies, including:    the Appalachian Regional Commission,   the Defense Nuclear Facilities Safety Board,   the Delta Regional Authority,   the Denali Commission,   the Northern Border Regional Commission,   the Southeast Crescent Regional Commission,   the Nuclear Regulatory Commission (NRC), and   the Nuclear Waste Technical Review Board.   (Sec. 401) Requires the NRC to comply with specified internal procedures when responding to congressional requests for information.  (Sec. 402) Specifies the circumstances in which funds provided by this title may be reprogrammed.  TITLE V--GENERAL PROVISIONS  (Sec. 501) Prohibits funds provided by this division from being used to influence congressional action on any legislation or appropriation matters pending before Congress.  (Sec. 502) Specifies restrictions and requirements for transfers of funds into and out of accounts funded by this division.  (Sec. 503) Prohibits funds provided by this division from being used to contravene Executive Order No. 12898 of February 11, 1994 (Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations).  (Sec. 504) Prohibits funds provided by this division from being used for a computer network that does not block pornography, except for law enforcement purposes.  (Sec. 505) Prohibits funds provided by this division from being used for further implementation of the coastal and marine spatial planning and ecosystem-based management components of the National Ocean Policy developed under Executive Order 13547 (Stewardship of the Ocean, Our Coasts, and the Great Lakes).  (Sec. 506) Prohibits funds provided by this division from being used for the removal of any federally owned or operated dam.  (Sec. 507) Prohibits the use of funds provided by this division: (1) to conduct closure of adjudicatory functions, technical review, or support activities associated with the Yucca Mountain geologic repository license application; or (2) for actions that irrevocably remove the possibility that Yucca Mountain may be a repository option in the future.  (Sec. 508) Specifies that, unless this bill expressly provides otherwise, references to \"this Act\" included in this division shall be treated as referring only to the provisions of this division.  (Sec. 509) Specifies the committee report that applies for the purpose of implementing this division.  (Sec. 510) Establishes a spending reduction account for the amount by which spending proposed in this division exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0.  (Sec. 511) Prohibits funds provided by this division from being used for the Cape Wind Energy Project on the Outer Continental Shelf off Massachusetts, Nantucket Sound.  (Sec. 512) Provides additional funding to the DOE Electricity Delivery and Energy Reliability account for certain energy storage systems demonstrations authorized by the Energy Independence and Security Act of 2007. Reduces funding for DOE's Departmental Administration account.  (Sec. 513) Prohibits funds provided by this division from being used in contravention of specified provisions of the Water Resources Reform and Development Act of 2014 and the Water Resources Development Act of 1986 that authorize appropriations for the operation and maintenance of certain harbor projects. (Sec. 514) Prohibits funds provided by title I (Corps of Engineers--Civil) of this division from being used to require an economic re-evaluation of any project authorized under title VIII of the Water Resources Development Act of 2007.  (Sec. 515) Revises the amounts provided by this division for the Corps of Engineers Investigations account. (Sec. 516) Revises the amounts provided by this division for the Corps of Engineers Construction account.  (Sec. 517) Prohibits funds provided by this division for Department of Energy--Energy Programs--Science from being used in contravention of the Department of Energy Organization Act.  (Sec. 518) Prohibits funds provided by this division from being used to prepare, propose, or promulgate any regulation or guidance that references or relies on the analysis contained in specified technical support documents and guidance related to the social cost of carbon and greenhouse gas emissions.  (Sec. 519) Prohibits funds provided by this division from being used to implement or enforce certain regulations and statutory provisions establishing energy conservation standards for incandescent lamps.  Department of Homeland Security Border Infrastructure Construction Appropriations Act, 2018  DIVISION E--DEPARTMENT OF HOMELAND SECURITY BORDER INFRASTRUCTURE CONSTRUCTION APPROPRIATION ACT, 2018  Provides additional funds to U.S. Customs and Border Protection for procurement, construction, and improvements.  Requires specified amount of the funding to remain available through FY2020 for:    32 miles of new border bollard fencing in the Rio Grande Valley, Texas;   28 miles of new bollard levee wall in the Rio Grande Valley, Texas;   14 miles of secondary fencing in San Diego, California; and   planning for border wall construction.   TITLE I--GENERAL PROVISIONS  (Sec. 101) Specifies that, unless this bill expressly provides otherwise, references to \"this Act\" included in this division shall be treated as referring only to the provisions of this division. ",
         "summary_short": "Highlights:  This bill provides FY2018 appropriations for several federal agencies. The bill includes 4 of the 12 regular FY2018 appropriations bills, including:    the Department of Defense Appropriations Act, 2018;   the Legislative Branch Appropriations Act, 2018;   the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2018; and   the Energy and Water Development and Related Agencies Appropriations Act, 2018.   The bill also includes the Department of Homela...",
         "versions":[
],
         "actions":[
         {
           "id": 116,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-08-01",
           "description": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 187."
         },
                  {
           "id": 115,
           "chamber": "Senate",
           "action_type": "Calendars",
           "datetime": "2017-07-31",
           "description": "Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time."
         },
                  {
           "id": 114,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - The House proceeded with 10 minutes of debate on the Roybal-Allard motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to strike the division of the underlying bill that appropriates $1.6 billion in funds to begin construction of border wall along the U.S. Mexico border."
         },
                  {
           "id": 113,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Ms. Roybal-Allard moved to recommit with instructions to the Committee on Appropriations."
         },
                  {
           "id": 112,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union."
         },
                  {
           "id": 111,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "The previous question was ordered pursuant to the rule."
         },
                  {
           "id": 110,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 3219."
         },
                  {
           "id": 109,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on adoption of amendments which had been debated earlier and on which further proceedings had been postponed."
         },
                  {
           "id": 108,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "VACATED PROCEEDINGS - Mr. Visclosky asked unanmious consent to vacate the proceedings for a recorded vote on the DeSantis amendment No. 47, to the end that the Chair put the question on the amendment de novo. Agreed to without objection."
         },
                  {
           "id": 107,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the DeSantis amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. DeSantis demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 106,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the DeSantis amendment No. 47."
         },
                  {
           "id": 105,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 45."
         },
                  {
           "id": 104,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Cartwright amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Cartwright demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 103,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Cartwright amendment No. 43."
         },
                  {
           "id": 102,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Foster amendment No. 42."
         },
                  {
           "id": 101,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Nadler amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Nadler demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 100,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Nadler amendment No. 38."
         },
                  {
           "id": 99,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Speier amendment No. 35."
         },
                  {
           "id": 98,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Dunn amendment No. 31."
         },
                  {
           "id": 97,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 13."
         },
                  {
           "id": 96,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Brendan F. Boyle amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Brendan F. Boyle demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 95,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Brendan F. Boyle amendment No. 12."
         },
                  {
           "id": 94,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Suozzi amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Suozzi demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 93,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Suozzi amendment No. 10."
         },
                  {
           "id": 92,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 478, the Committee of the Whole proceeded with 10 minutes of debate on the Langevin amendment No. 8."
         },
                  {
           "id": 91,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 478, the Committee of the Whole proceeded with 20 minutes of debate on the Granger en bloc amendment No. 1."
         },
                  {
           "id": 90,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 478 and Rule XVIII."
         },
                  {
           "id": 89,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Pursuant to the provisions of H.Res. 478, the House proceeded with further consideration of H.R. 3219."
         },
                  {
           "id": 88,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Considered as unfinished business."
         },
                  {
           "id": 87,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was on adoption of amendments, which were debated earlier and on which further proceedings were postponed."
         },
                  {
           "id": 86,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "The House resolved into Committee of the Whole House on the state of the Union for further consideration."
         },
                  {
           "id": 85,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Committee of the Whole House on the state of the Union rises leaving H.R. 3219 as unfinished business."
         },
                  {
           "id": 84,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "On motion that the Committee now rise Agreed to by voice vote."
         },
                  {
           "id": 83,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Mr. Simpson moved that the Committee now rise."
         },
                  {
           "id": 82,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Mitchell amendment No. 70."
         },
                  {
           "id": 81,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Budd amendment No. 64."
         },
                  {
           "id": 80,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Ms. Kaptur demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 79,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Considered as unfinished business. (consideration: CR H6493-6512)"
         },
                  {
           "id": 78,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Considered as unfinished business. (consideration: CR H6491-6492)"
         },
                  {
           "id": 77,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 76,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "On passage Passed by the Yeas and Nays: 235 - 192 (Roll no. 435)."
         },
                  {
           "id": 75,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "On motion to recommit with instructions Failed by recorded vote: 193 - 234 (Roll no. 434)."
         },
                  {
           "id": 74,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-27",
           "description": "The previous question on the motion to recommit with instructions was ordered without objection."
         },
                  {
           "id": 73,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered as unfinished business. (consideration: CR H6437-6462)"
         },
                  {
           "id": 72,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered as unfinished business. (consideration: CR H6428-6437)"
         },
                  {
           "id": 71,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered under the provisions of rule H. Res. 473. (consideration: CR H6335-6462; text: CR H6371-6407)"
         },
                  {
           "id": 70,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 63."
         },
                  {
           "id": 69,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Blackburn amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mrs. Blackburn demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 68,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Blackburn amendment No. 62."
         },
                  {
           "id": 67,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Burgess amendment No. 61."
         },
                  {
           "id": 66,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the DelBene amendment No. 60."
         },
                  {
           "id": 65,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 59."
         },
                  {
           "id": 64,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 58."
         },
                  {
           "id": 63,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 57."
         },
                  {
           "id": 62,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on adoption of amendments which had been debated earlier and on which further proceedings had been postponed."
         },
                  {
           "id": 61,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 60,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 56."
         },
                  {
           "id": 59,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Kihuen amendment No. 55."
         },
                  {
           "id": 58,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Pingree amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Pingree demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 57,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Pingree amendment No. 54."
         },
                  {
           "id": 56,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Rosen amendment No. 53."
         },
                  {
           "id": 55,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Garamendi amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Garamendi demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 54,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Garamendi amendment No. 52."
         },
                  {
           "id": 53,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Foster amendment No. 51."
         },
                  {
           "id": 52,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Michelle Lujan Grisham (NM) amendment No. 50."
         },
                  {
           "id": 51,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 49."
         },
                  {
           "id": 50,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Esty(CT) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Esty(CT) demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 49,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Esty (CT) amendment No. 44."
         },
                  {
           "id": 48,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 43."
         },
                  {
           "id": 47,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "The House resolved into Committee of the Whole House on the state of the Union for further consideration."
         },
                  {
           "id": 46,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered as unfinished business."
         },
                  {
           "id": 45,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Committee of the Whole House on the state of the Union rises leaving H.R. 3219 as unfinished business."
         },
                  {
           "id": 44,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "On motion that the Committee rise Agreed to by voice vote."
         },
                  {
           "id": 43,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Mr. Simpson moved that the Committee rise."
         },
                  {
           "id": 42,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the McKinley amendment No. 42."
         },
                  {
           "id": 41,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Polis amendment No. 41."
         },
                  {
           "id": 40,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Quigley amendment No. 40."
         },
                  {
           "id": 39,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Norcross amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Norcross demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 38,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Norcross amendment No. 39."
         },
                  {
           "id": 37,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Castor(FL) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Castor(FL) demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 36,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Castor (FL) amendment No. 38."
         },
                  {
           "id": 35,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Kaptur amendment No. 37."
         },
                  {
           "id": 34,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to a previous special order of the House, the Committee of the Whole proceeded with 10 minutes of debate on the Heck amendment No. 35."
         },
                  {
           "id": 33,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to a previous special order of the House, the Committee of the Whole proceeded with 10 minutes of debate on the Mast amendment No. 32."
         },
                  {
           "id": 32,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Mitchell amendment No. 36."
         },
                  {
           "id": 31,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 20 minutes of debate on the Simpson en bloc amendment No. 2."
         },
                  {
           "id": 30,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Bergman amendment No. 27."
         },
                  {
           "id": 29,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the King (IA) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Ms. Wasserman Schultz demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 28,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the King (IA) amendment No. 23."
         },
                  {
           "id": 27,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Brat amendment No. 21."
         },
                  {
           "id": 26,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Ratcliffe amendment No. 20."
         },
                  {
           "id": 25,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Al Green amendment No. 13."
         },
                  {
           "id": 24,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 20 minutes of debate on the Dent en bloc amendment No. 1."
         },
                  {
           "id": 23,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Bergman amendment No. 11."
         },
                  {
           "id": 22,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Russell amendment No. 9."
         },
                  {
           "id": 21,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Shea-Porter amendment No. 8."
         },
                  {
           "id": 20,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Takano amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Takano demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 19,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Takano amendment No. 7."
         },
                  {
           "id": 18,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Cicilline amendment No. 6."
         },
                  {
           "id": 17,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Griffith amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Griffith demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 16,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 5."
         },
                  {
           "id": 15,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Mr. Ryan(OH) demanded a recorded vote, and the Chair postponed further proceedings on the question of adoption of the amendment until later in the legislative day."
         },
                  {
           "id": 14,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 4."
         },
                  {
           "id": 13,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Kildee amendment No. 3."
         },
                  {
           "id": 12,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Love amendment No. 2."
         },
                  {
           "id": 11,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 473, the Committee of the Whole proceeded with 10 minutes of debate on the Connolly amendment No. 1."
         },
                  {
           "id": 10,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "GENERAL DEBATE - The Committee of the Whole proceeded with two hours of general debate on H.R. 3219."
         },
                  {
           "id": 9,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "The Speaker designated the Honorable Mike Bost to act as Chairman of the Committee."
         },
                  {
           "id": 8,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 473 and Rule XVIII."
         },
                  {
           "id": 7,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Rule provides for consideration of H.R. 3219 with 2 hours of general debate. The resolution provides that an amendment in the nature of a substitute consisting of the text of Rules Committee Print 115-30 shall be considered as adopted and the bill, as amended, shall be considered as read."
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered under the provisions of rule H. Res. 473."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Rule H. Res. 473 passed House."
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-26",
           "description": "Considered under the provisions of rule H. Res. 473. (consideration: CR H6335-6428; text: CR H6371-6407)"
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-07-25",
           "description": "Rules Committee Resolution H. Res. 473 Reported to House. Rule provides for consideration of H.R. 3219 with 2 hours of general debate. The resolution provides that an amendment in the nature of a substitute consisting of the text of Rules Committee Print 115-30 shall be considered as adopted and the bill, as amended, shall be considered as read."
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-07-13",
           "description": "Placed on the Union Calendar, Calendar No. 154."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-07-13",
           "description": "The House Committee on Appropriations reported an original measure, H. Rept. 115-219, by Ms. Granger."
         }
         ],
         "votes": [
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "17:19:00",
             "roll_call": "435",
             "question": "On Passage",
             "result": "Passed",
             "total_yes": 235,
             "total_no": 192,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/435.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "17:13:00",
             "roll_call": "434",
             "question": "On Motion to Recommit with Instructions",
             "result": "Failed",
             "total_yes": 193,
             "total_no": 234,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/434.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "16:56:00",
             "roll_call": "433",
             "question": "On Agreeing to the Amendment",
             "result": "Agreed to",
             "total_yes": 253,
             "total_no": 172,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/433.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "16:51:00",
             "roll_call": "432",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 172,
             "total_no": 252,
             "total_not_voting": 9,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/432.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "16:46:00",
             "roll_call": "431",
             "question": "On Agreeing to the Amendment",
             "result": "Agreed to",
             "total_yes": 256,
             "total_no": 169,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/431.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "16:41:00",
             "roll_call": "430",
             "question": "On Agreeing to the Amendment",
             "result": "Agreed to",
             "total_yes": 214,
             "total_no": 211,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/430.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "14:24:00",
             "roll_call": "429",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 177,
             "total_no": 248,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/429.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-27",
             "time": "14:20:00",
             "roll_call": "428",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 140,
             "total_no": 285,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/428.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:20:00",
             "roll_call": "425",
             "question": "On Agreeing to the Amendment",
             "result": "Agreed to",
             "total_yes": 234,
             "total_no": 192,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/425.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:15:00",
             "roll_call": "424",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 192,
             "total_no": 235,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/424.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:12:00",
             "roll_call": "423",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 180,
             "total_no": 247,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/423.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:09:00",
             "roll_call": "422",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 203,
             "total_no": 224,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/422.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:06:00",
             "roll_call": "421",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 186,
             "total_no": 241,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/421.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:03:00",
             "roll_call": "420",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 181,
             "total_no": 246,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/420.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "23:00:00",
             "roll_call": "419",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 178,
             "total_no": 249,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/419.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "22:57:00",
             "roll_call": "418",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 191,
             "total_no": 236,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/418.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "22:53:00",
             "roll_call": "417",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 116,
             "total_no": 309,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/417.json"
           },
           {
             "chamber": "House",
             "date": "2017-07-26",
             "time": "22:48:00",
             "roll_call": "416",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 107,
             "total_no": 314,
             "total_not_voting": 12,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/416.json"
           }
         ]

      }
   ]
}
