{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr3266-115",
         "bill_slug": "hr3266",
         "congress": "115",
         "bill": "H.R.3266",
         "bill_type": "hr",
         "number": "H.R.3266",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr3266.json",
         "title": "Energy and Water Development and Related Agencies Appropriations Act, 2018",
         "short_title": "Energy and Water Development and Related Agencies Appropriations Act, 2018",
         "sponsor_title": "Rep.",
         "sponsor": "Mike Simpson",
         "sponsor_id": "S001148",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/S001148.json",
         "sponsor_party": "R",
         "sponsor_state": "ID",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr3266rh/pdf/BILLS-115hr3266rh.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/3266",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr3266",
         "introduced_date": "2017-07-17",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 0,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Economics and Public Finance",
         "committees": "House Appropriations Committee",
         "committee_codes": ["HSAP"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-07-17",
         "latest_major_action": "Placed on the Union Calendar, Calendar No. 163.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for:    the civil works projects of the U.S. Army Corps of Engineers;   the Department of the Interior's Bureau of Reclamation and Central Utah Project;   the Department of Energy (DOE); and   several independent agencies, including the Nuclear Regulatory Commission.   The bill decreases discretionary FY2018 Energy and Water Development funding below FY2017 levels.  Compared to FY2017 levels, the bill increases funding for the Army Corps of Engineers and decreases funding for both DOE and the Bureau of Reclamation.  Within the DOE budget, the bill does not fund the Advanced Research Project Agency-Energy program and reduces funding for several other energy research programs. The bill funds DOE's science research at the FY2017 level and increases funding for the National Nuclear Security Administration.  The bill also includes provisions that affect policies in areas such as:   federal jurisdiction under the Federal Water Pollution Control Act (commonly known as the Clean Water Act),  the drawdown and sale of oil from the Strategic Petroleum Reserve, the possession of firearms on Corps of Engineers lands, and  nuclear nonproliferation projects in Russia.   Full Summary:  Energy and Water Development and Related Agencies Appropriations Act, 2018  TITLE I--CORPS OF ENGINEERS--CIVIL  Provides appropriations to the U.S. Army Corps of Engineers for authorized civil functions pertaining to rivers and harbors, flood and storm damage reduction, shore protection, aquatic ecosystem restoration, and related efforts.  Provides appropriations to the Corps of Engineers for:    Investigations;   Construction;   Mississippi River and Tributaries, including flood damage reduction projects in the Mississippi River alluvial valley below Cape Girardeau, Missouri;   Operation and Maintenance;   the Regulatory Program pertaining to navigable waters and wetlands;   the Formerly Utilized Sites Remedial Action Program for clean-up of early atomic energy program contamination;   Flood Control and Coastal Emergencies, including hurricanes, floods, and other natural disasters;   Expenses, necessary for the supervision and general administration of the civil works program; and   the Office of the Assistant Secretary of the Army for Civil Works.   (Sec. 101) Prohibits the reprogramming of funds provided by this title except in specified circumstances.  (Sec. 102) Prohibits funds provided by this title from being used for a contract that commits funds beyond the amounts appropriated for that program, project, or activity that remain unobligated. Includes exception for funds made available through reprogramming.  (Sec. 103) Permits the Corps of Engineers to transfer to the U.S. Fish and Wildlife Service up to $5.4 million in Operation and Maintenance funds to mitigate for fisheries lost due to Corps of Engineers projects.  (Sec. 104) Prohibits funds provided by this bill from being used for an open lake placement of dredged material originating from Lake Erie or its tributaries unless it is approved under a state water quality certification. Requires the Corps to continue upland placement of the dredged material until an open lake placement for dredged materials is approved under a state water quality certification.  (Sec. 105) Requires acquisitions funded by this title to comply with regulations that prohibit the Department of Defense from purchasing a certain anchor and mooring chain unless it is procured from a U.S. manufacturer.  (Sec. 106) Prohibits funds provided by this bill from being used for a water supply reallocation study under the Wolf Creek Dam, Lake Cumberland, Kentucky, project authorized under the Act of July 24, 1946.  (Sec. 107) Prohibits funds made available by this bill from being used to require a permit for the discharge of dredged or fill material under Federal Water Pollution Control Act (commonly known as the Clean Water Act) for specified agricultural activities.  (Sec. 108) Authorizes the Environmental Protection Agency and the Army Corps of Engineers to withdraw the Waters of the United States rule without regard to any provision of statute or regulation that establishes a requirement for withdrawal. (This provision applies to the final rule issued by the two agencies on June 29, 2015, and titled \"Clean Water Rule: Definition of 'Waters of the United States.'\" The rule revised regulations defining the scope of waters protected and regulated under the Clean Water Act.)  (Sec. 109) Permits individuals to possess firearms at Corps of Engineers water resources development projects if: (1) the individual is not otherwise prohibited by law from possessing the firearm, and (2) the possession of the firearm complies with the law of the state in which the project is located. (The Corps of Engineers currently prohibits private individuals from possessing firearms and other weapons at the projects unless the weapons are being used for hunting, at authorized shooting ranges, or with written permission of the Corps District Commander.)  TITLE II--DEPARTMENT OF THE INTERIOR  Provides appropriations to the Department of the Interior for the Central Utah Project.  Provides appropriations to the Bureau of Reclamation for:    Water and Related Resources,   the Central Valley Project Restoration Fund,   California Bay-Delta Restoration, and   Policy and Administration.   Permits appropriations to the Bureau of Reclamation to be used for purchasing replacements for up to five passenger motor vehicles.  (Sec. 201) Specifies the circumstances in which Reclamation may reprogram or transfer funds provided by this title.  (Sec. 202) Prohibits funds provided by this bill from being used to determine the final point of discharge for the interceptor drain for the San Luis Unit until Interior and California develop a plan to minimize any detrimental effect of the San Luis drainage waters. Requires the plan to conform to California water quality standards as approved by the Environmental Protection Agency.  Directs Interior to classify the costs of the Kesterson Reservoir Cleanup Program and the San Joaquin Valley Drainage Program as either reimbursable or nonreimbursable and collected until fully repaid pursuant to specified alternative repayment plans.  Requires future federal obligations of funds regarding drainage service or drainage studies for the San Luis Unit to be fully reimbursable by San Luis Unit beneficiaries of the service or studies.  (Sec. 203) Prohibits funds provided by this bill from being used to implement the San Joaquin River Restoration Settlement Agreement.  TITLE III--DEPARTMENT OF ENERGY  Provides appropriations to the Department of Energy (DOE) for Energy Programs, including:    Energy Efficiency and Renewable Energy,   Electricity Delivery and Energy Reliability,   Nuclear Energy,   Fossil Energy Research and Development,   Naval Petroleum and Oil Shale Reserves,   the Strategic Petroleum Reserve,   the Northeast Home Heating Oil Reserve,   the Energy Information Administration,   Non-Defense Environmental Cleanup,   the Uranium Enrichment Decontamination and Decommissioning Fund,   Science,   Nuclear Waste Disposal,   the Title 17 Innovative Technology Loan Guarantee Loan Program,   the Advanced Technology Vehicles Manufacturing Loan Program,   the Tribal Energy Loan Guarantee Program,   Departmental Administration, and   the Office of the Inspector General.   Provides appropriations for the Atomic Energy Defense Activities of the National Nuclear Security Administration (NNSA), including:    Weapons Activities,   Defense Nuclear Nonproliferation,   Naval Reactors, and   Federal Salaries and Expenses.   Provides appropriations for Environmental and Other Defense Activities, including:    Defense Environmental Cleanup,   Other Defense Activities, and   Defense Nuclear Waste Disposal.   Provides appropriations for the Power Marketing Administrations, including:    the Bonneville Power Administration Fund;   Southeastern Power Administration Operation and Maintenance;   Southwestern Power Administration Operation and Maintenance;   Western Area Power Administration Operation and Maintenance, Construction, and Rehabilitation; and   the Falcon and Amistad Operating and Maintenance Fund.   Provides appropriations for the Federal Energy Regulatory Commission.  (Sec. 301) Prohibits funds provided by this title from be used for programs, projects, or activities that have not been funded by Congress.  Prohibits specified grants, contracts, allocations, and agreements unless Congress is notified in advance.  Prohibits funds from being used for certain multiyear Department of Energy--Energy Programs activities unless specified conditions are met and Congress is notified.  Establishes requirements and restrictions for the reprogramming of funds provided in this title.  Permits unexpended balances of prior appropriations provided for activities in this bill to be transferred and merged with appropriations accounts established in this bill.  (Sec. 302) Deems funds appropriated by this bill for intelligence activities to be specifically authorized by Congress during FY2018 until the enactment of the Intelligence Authorization Act for FY2018.  (Sec. 303) Prohibits funds provided by this title from being used to construct specified high-hazard nuclear facilities unless independent oversight is conducted by the Office of Independent Enterprise Assessments to ensure compliance with nuclear safety requirements.  (Sec. 304) Prohibits funds provided by this title from being used to approve certain critical decisions for construction projects exceeding $100 million until a separate independent cost estimate has been developed.  (Sec. 305) Prohibits Defense Nuclear Nonproliferation funds from being used for contracts with or agreements for federal assistance to the Russian Federation. Permits DOE to waive the prohibition if the activity is in the national security interests of the United States and a report justifying the waiver is submitted to Congress.  (Sec. 306) Authorizes DOE to draw down and sell refined petroleum product from the Strategic Petroleum Reserve (SPR) upon a determination by the President in this fiscal year that:    a regional supply shortage of refined petroleum product of significant scope and duration exists,   a severe increase in the price of refined petroleum product will likely result from the shortage, and   a draw down and sale of refined petroleum product would assist directly and significantly in reducing the adverse impact of the shortage.   Specifies that the proceeds from the sale must be deposited into the SPR Petroleum Account and remain available for obligation without fiscal year limitation, consistent with the Energy Policy and Conservation Act. (Sec. 307) Requires DOE to drawdown and sell up to $8.4 million of crude oil from the SPR during this fiscal year (in addition to sales authorized under the Bipartisan Budget Act of 2015). Requires the proceeds from the sale to be deposited into the SPR Petroleum Account to remain available until expended for: (1) the costs of crude oil sales authorized under the Bipartisan Budget Act of 2015, and (2) specified provisions of the 21st Century Cures Act.  Prohibits DOE from drawing down and selling crude oil under this section in amounts that would limit the authority to sell petroleum products under the Energy Policy and Conservation Act in order to prevent or reduce adverse impacts of severe domestic energy supply interruptions.  (Sec. 308) Prohibits DOE from establishing any new regional petroleum product reserve unless funding is explicitly requested in advance and approved by Congress in an appropriations Act.  (Sec. 309) Limits the amount of funds provided by this title that may be transferred to the working capital fund established under the Department of Energy Organization Act.  TITLE IV--INDEPENDENT AGENCIES  Provides appropriations for independent agencies, including:    the Appalachian Regional Commission,   the Defense Nuclear Facilities Safety Board,   the Delta Regional Authority,   the Denali Commission,   the Northern Border Regional Commission,   the Southeast Crescent Regional Commission,   the Nuclear Regulatory Commission (NRC), and   the Nuclear Waste Technical Review Board.   (Sec. 401) Requires the NRC to comply with specified internal procedures when responding to congressional requests for information. (Sec. 402) Specifies the circumstances in which funds provided by this title may be reprogrammed.  TITLE V--GENERAL PROVISIONS  (Sec. 501) Prohibits funds provided by this bill from being used to influence congressional action on any legislation or appropriation matters pending before Congress.  (Sec. 502) Specifies restrictions and requirements for transfers of funds into and out of accounts funded by this bill.  (Sec. 503) Prohibits funds provided by this bill from being used to contravene Executive Order No. 12898 of February 11, 1994 (Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations).  (Sec. 504) Prohibits funds provided by this bill from being used for a computer network that does not block pornography, except for law enforcement purposes.  (Sec. 505) Prohibits funds provided by this bill from being used for further implementation of the coastal and marine spatial planning and ecosystem-based management components of the National Ocean Policy developed under Executive Order 13547 (Stewardship of the Ocean, Our Coasts, and the Great Lakes).  (Sec. 506) Prohibits funds provided by this bill from being used for the removal of any federally owned or operated dam.  (Sec. 507) Prohibits the use of funds provided by this bill: (1) to conduct closure of adjudicatory functions, technical review, or support activities associated with the Yucca Mountain geologic repository license application; or (2) for actions that irrevocably remove the possibility that Yucca Mountain may be a repository option in the future.  (Sec. 508) Establishes a spending reduction account for the amount by which spending proposed in this bill exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0. (Under the Rules of the House of Representatives, any savings included in the spending reduction account are not available for further appropriation during consideration of the bill.) ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for:    the civil works projects of the U.S. Army Corps of Engineers;   the Department of the Interior's Bureau of Reclamation and Central Utah Project;   the Department of Energy (DOE); and   several independent agencies, including the Nuclear Regulatory Commission.   The bill decreases discretionary FY2018 En...",
         "versions":[
],
         "actions":[
         {
           "id": 2,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-07-17",
           "description": "Placed on the Union Calendar, Calendar No. 163."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-07-17",
           "description": "The House Committee on Appropriations reported an original measure, H. Rept. 115-230, by Mr. Simpson."
         }
         ],
         "votes": [
         ]

      }
   ]
}
