{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr3268-115",
         "bill_slug": "hr3268",
         "congress": "115",
         "bill": "H.R.3268",
         "bill_type": "hr",
         "number": "H.R.3268",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr3268.json",
         "title": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2018",
         "short_title": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2018",
         "sponsor_title": "Rep.",
         "sponsor": "Robert B. Aderholt",
         "sponsor_id": "A000055",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/A000055.json",
         "sponsor_party": "R",
         "sponsor_state": "AL",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr3268rh/pdf/BILLS-115hr3268rh.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/3268",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr3268",
         "introduced_date": "2017-07-17",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 0,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Economics and Public Finance",
         "committees": "House Appropriations Committee",
         "committee_codes": ["HSAP"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-07-17",
         "latest_major_action": "Placed on the Union Calendar, Calendar No. 165.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for the Department of Agriculture (USDA), except for the Forest Service which is included in the Department of the Interior, Environment, and Related Agencies appropriations bill.  It also provides appropriations for the Food and Drug Administration (FDA), the Commodity Futures Trading Commission (CFTC), and the Farm Credit Administration.  The bill includes both discretionary and mandatory funding. The mandatory funding levels are generally set by authorizing legislation such as the farm bill and are frequently limited in the agriculture appropriations bill.  The bill decreases discretionary funding for Agriculture, Rural Development, Food and Drug Administration, and Related Agencies below FY2017 levels.  Also included in the bill are provisions that affect policies in areas such as:    regulation of newly deemed tobacco products such as electronic cigarettes (e-cigarettes) and cigars,   inventory requirements for SNAP-authorized retailers,   nutrition standards for school meals, and   imports of poultry products from China.   The bill also enacts specified provisions of H.R. 238 (the Commodity End-User Relief Act), as passed by the House of Representatives on January 12, 2017.  Full Summary:  Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2018  Provides FY2018 appropriations to the Department of Agriculture (USDA), the Food and Drug Administration (FDA), and related agencies.  TITLE I--AGRICULTURAL PROGRAMS  Provides appropriations for the following agricultural programs and services:    the Office of the Secretary;   Executive Operations;   the Office of the Chief Information Officer;   the Office of the Chief Financial Officer;   the Office of the Assistant Secretary for Civil Rights;   the Office of Civil Rights;   Hazardous Materials Management;   the Office of Inspector General;   the Office of the General Counsel;   the Office of Ethics;   the Office of the Under Secretary for Research, Education, and Economics;   the Economic Research Service;   the National Agricultural Statistics Service;   the Agricultural Research Service;   the National Institute of Food and Agriculture;   the Office of the Under Secretary for Marketing and Regulatory Programs;  the Animal and Plant Health Inspection Service;   the Agricultural Marketing Service;   the Grain Inspection, Packers and Stockyards Administration;   the Office of the Under Secretary for Food Safety; and   the Food Safety and Inspection Service.   TITLE II--FARM PRODUCTION AND CONSERVATION PROGRAMS  Provides appropriations for:    the Office of the Under Secretary for Farm Production and Conservation,   the Farm Service Agency,   the Risk Management Agency,   the Natural Resources Conservation Service,   the Federal Crop Insurance Corporation Fund, and   the Commodity Credit Corporation Fund.   TITLE III--RURAL DEVELOPMENT PROGRAMS  Provides appropriations for Rural Development Programs including:    Rural Development Salaries and Expenses,   the Rural Housing Service,   the Rural Business--Cooperative Service,   the Rural Utilities Service, and   the Rural Economic Infrastructure Account.   TITLE IV--DOMESTIC FOOD PROGRAMS  Provides appropriations for the Office of the Under Secretary for Food, Nutrition, and Consumer Services.  Provides appropriations to the Food and Nutrition Service for:    Child Nutrition Programs;   the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC);   the Supplemental Nutrition Assistance Program (SNAP, formerly known as food stamps);   the Commodity Assistance Program; and   Nutrition Programs Administration.   TITLE V--FOREIGN ASSISTANCE AND RELATED PROGRAMS  Provides appropriations to the Office of the Under Secretary for Trade and Foreign Agricultural Affairs.  Provides appropriations for the Foreign Agricultural Service, including:    the Food for Peace Act (P.L. 480),   the McGovern-Dole International Food for Education and Child Nutrition Program, and   the Commodity Credit Corporation Export (loans) Credit Guarantee Program Account.   TITLE VI--RELATED AGENCIES AND FOOD AND DRUG ADMINISTRATION  Provides appropriations to:  the Department of Health and Human Services for the Food and Drug Administration (FDA). the Commodity Futures Trading Commission, and the Farm Credit Administration.   TITLE VII--GENERAL PROVISIONS  (Sec. 701) Permits USDA to use funds provided by this bill for the purchase, replacement, and hire of passenger motor vehicles.  (Sec. 702) Permits USDA to transfer unobligated balances to the Working Capital Fund for the acquisition of plant and capital equipment for financial, administrative, and information technology services. Permits the transferred funds to remain available until expended and specifies restrictions on the use of the funds.  (Sec. 703) Prohibits appropriations provided by this bill from remaining available for obligation beyond the current fiscal year unless the bill expressly provides otherwise.  (Sec. 704) Limits negotiated indirect costs on cooperative agreements between USDA and nonprofit institutions to 10% of the total direct cost of the agreement when the purpose of the agreement is to carry out programs of mutual interest between the two parties.  (Sec. 705) Permits appropriations for direct and guaranteed loans to remain available until expended to disburse obligations made in the current fiscal year for: (1) the Rural Development Loan Fund program account, (2) the Rural Electrification and Telecommunication Loans program account, and (3) the Rural Housing Insurance Fund program account.  (Sec. 706) Prohibits USDA from using funds provided by this bill to acquire or upgrade information technology systems without approval of the Chief Information Officer (CIO) and the Executive Information Technology Investment Review Board. Restricts the transfer of funds made available by this bill to the CIO without prior approval of Congress. Prohibits funds from being used for specified information technology projects without the approval of the CIO.  (Sec. 707) Permits specified funds provided under the Federal Crop Insurance Act for the Agricultural Management Assistance Program in the current fiscal year to remain available until expended to disburse obligations made in the current fiscal year.  (Sec. 708) Makes a former Rural Utility Service borrower that has repaid or prepaid a loan under the Rural Electrification Act of 1936 or any not-for-profit utility qualified to receive a loan under the Act eligible for rural economic development and job creation assistance in the same manner as a borrower.  (Sec. 709) Permits specified unobligated balances of appropriations provided by this bill for salaries and expenses of the Farm Service Agency and the Rural Development mission area to remain available through FY2019 for information technology expenses.  (Sec. 710) Prohibits funds provided by this bill from being used for first-class travel by employees of agencies funded by this bill.  (Sec. 711) Provides that Commodity Credit Corporation funds authorized or required to be used for specified programs included in the Agricultural Act of 2014: (1) shall be available for salaries and administrative expenses associated with the programs without regard to allotment and transfer limits, and (2) shall not be considered to be a fund transfer or allotment for purposes of applying the limits.  (Sec. 712) Limits funds available for USDA advisory committees, panels, commissions, and task forces, except for panels used to comply with negotiated rulemaking or to evaluate competitively awarded grants.  (Sec. 713) Prohibits funds provided by this bill from being used to pay indirect costs charged against any agricultural research, education, or extension grant awards issued by the National Institute of Food and Agriculture (NIFA) that exceed 30% of total federal funds provided under each award.  Permits funds provided by this bill for grants awarded competitively by NIFA to be used to pay full allowable indirect costs for specified research and development grants awarded under the Small Business Act.  (Sec. 714) Limits funds that may be used for the following programs:    the Watershed Rehabilitation Program;   the Rural Energy for America Program;   the Biomass Crop Assistance Program;   the Biorefinery, Renewable Chemical, and Biobased Product Manufacturing Assistance Program; and   the Agricultural Management Assistance Program.   (Sec. 715) Limits funds for the following domestic food assistance categories:    Child Nutrition Programs Entitlement Commodities,   State Option Contracts,   Removal of Defective Commodities, and   Administration of Section 32 Commodity Purchases.   Limits FY2018 funds for the Fresh Fruit and Vegetable Program that provides fruit and vegetables to students in participating elementary schools.  Prohibits USDA from using funds for payments authorized by Section 32 of the Agricultural Adjustment Act of 1935 to increase purchasing power of agricultural producers or for surplus removal or price support activities authorized by the Commodity Credit Corporation Charter Act.  (Section 32 is a program created to assist agricultural producers of non-price-supported commodities and is funded by a permanent appropriation of a portion of the previous year's customs receipts less certain mandatory transfers to child nutrition and other programs. This provision effectively prohibits the use of Section 32 for emergency disaster payments.)  Rescinds specified unobligated balances provided for domestic food assistance programs.  (Sec. 716) Prohibits funds from being used to prepare proposals for the President's budget that assume savings from certain user fee proposals without identifying additional spending reductions that should occur if the proposals are not enacted.  (Sec. 717) Sets forth procedures, requirements, and restrictions for reprogramming and transferring funds provided by this bill.  (Sec. 718) Permits USDA to assess a one-time fee for any guaranteed business and industry loan and limits the fee to 3% of the guaranteed principal portion of the loan.  (Sec. 719) Prohibits funds from being used to provide reports, questions, or responses to questions that are a result of information requested for the appropriations hearing process to anyone not employed by USDA, the Food and Drug Administration, the Commodity Futures Trading Commission, or the Farm Credit Administration.  (Sec. 720) Prohibits any executive branch agency from using funds provided by this bill to produce a prepackaged news story for U.S. broadcast or distribution unless the story includes a clear notification that it was prepared or funded by the agency. (Sec. 721) Prohibits USDA employees from being detailed or assigned from an agency funded by this bill to any other USDA agency or office for more than 60 days in a fiscal year unless the individual's employing agency is reimbursed by the receiving agency for the salary and expenses of the employee.  (Sec. 722) Requires USDA to: (1) notify Congress at least three full business days in advance of making certain grant allocations or contract awards that are at least $1 million, and (2) submit quarterly reports to Congress detailing grant allocations or discretionary grant awards that are less than $1 million.  (Sec. 723) Directs the agencies funded by this bill to submit spending plans to Congress.  (Sec. 724) Provides that funds for title II of the Food for Peace Act may only be used to assist nations if adequate monitoring and controls exist to ensure that emergency food aid is received by the intended beneficiaries in areas affected by food shortages and not diverted for unauthorized or inappropriate purposes.  (Sec. 725) Requires USDA to establish an intermediary loan packaging program based on the FY2013 pilot program for packaging and reviewing section 502 single family direct loans. (The loan program assists low-income applicants in purchasing homes in rural areas. Funds may also be used to build, repair, or renovate a house, including providing water and sewage facilities.)  (Sec. 726) Permits USDA to increase the program level by up to 25% for certain loans and loan guarantees that do not require budget authority and have program levels established by this bill. Requires congressional notification prior to implementing any increase.  (Sec. 727) Provides that certain credit card refunds or rebates transferred to the Working Capital Fund: (1) shall not be available for obligation without congressional approval; and (2) shall only be available for the acquisition of plant and capital equipment for USDA financial, administrative, and information technology services.  (Sec. 728) Prohibits funds provided by this bill from being used to procure raw or processed poultry products from China for the National School Lunch Program, the Child and Adult Food Care Program, the Summer Food Service Program, or the School Breakfast Program.  (Sec. 729) Permits USDA to respond to a community with inadequate drinking water supplies due to a natural disaster by providing potable water through the Emergency Community Water Assistance Grant Program for up to 120 days beyond the time period established in the program.  (Sec. 730) Specifies the matching requirements that apply to funds appropriated for the Agriculture and Food Research Initiative.  (Sec. 731) Prohibits the Food and Nutrition Service from using funds provided by this bill for any new research and evaluation projects until after a research and evaluation plan is submitted to Congress.  (Sec. 732) Sets forth the authorities that apply for USDA to provide loans for housing and buildings on adequate farms.  (Sec. 733) Prohibits funds provided by this bill from being used for regulations to allow or require information intended for a prescribing health care professional, in the case of a drug or biological product, to be distributed electronically (in lieu of in paper form) until a federal law is enacted to allow or require electronic distribution.  (Sec. 734) Prohibits the FDA from acknowledging applications for an exemption for investigational use of a drug or biological product in research in which a human embryo is intentionally created or modified to include a heritable genetic modification. Provides that any submission is deemed not to have been received, and the exemption may not go into effect.  (Sec. 735) Prohibits funds from being used to carry out provisions of the final FDA rule titled \"Current Good Manufacturing Practice and Hazard Analysis and Risk-Based Preventive Controls for Food for Animals\" with respect to certain requirements that apply to the production, distribution, sale, or receipt of dried spent grain by-products of the alcoholic beverage production process.  (Sec. 736) Requires the Animal and Plant Health Inspection Service (APHIS) to conduct audits in a manner that evaluates the following factors in the country or region being audited, as applicable:   veterinary control and oversight,   disease history and vaccination practices,   livestock demographics and traceability,   epidemiological separation from potential sources of infection,   surveillance practices,   diagnostic laboratory capabilities, and  emergency preparedness and response.   Requires APHIS to make reports regarding the audits publicly available.  (Sec. 737) Prohibits funds provided by this bill from being used to issue or renew licenses under the Animal Welfare Act for certain dealers who sell dogs and cats for research, experiments, teaching, or testing.  (Sec. 738) Prohibits the FDA from deeming partially hydrogenated oils to be unsafe or any food containing a partially hydrogenated oil to be adulterated prior to June 18, 2018.  (Sec. 739) Permits USDA to charge a fee for lenders to access USDA loan guarantee systems in connection with participation in the loan guarantee programs of the Rural Housing Service.  (Sec. 740) Prohibits funds provided by this bill from being used for a computer network unless pornography is blocked, with the exception of law enforcement, prosecution, or adjudication activities.  (Sec. 741) Rescinds specified unobligated balances from the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC).  (Sec. 742) Prohibits funds provided for the rural water, waste water, waste disposal, and solid waste management programs authorized by the Consolidated Farm and Rural Development Act from being used for the construction, alteration, maintenance, or repair of a public water or wastewater system unless all of the iron and steel products used in the project are produced in the United States. Specifies exceptions and waiver procedures.  (Sec. 743) Requires USDA to permit states to grant exemptions from whole grain requirements for the National School Lunch Program and the School Breakfast Program that took effect on or after July 1, 2014.  Requires states to establish a process for responding to exemption requests, provided that school food authorities demonstrate hardship in procuring whole grain products compliant with new standards and comply with whole grain standards in effect prior to July 1, 2014.  Prohibits funds from being used to implement regulations requiring a specified reduction in sodium in federally reimbursed meals, foods, and snacks sold in schools.  Requires USDA to allow states to grant special exemptions for the service of flavored, low-fat fluid milk in the School Lunch Program and the School Breakfast Program and as a competitive food available on campus during the school day, to schools which demonstrate a reduction in student milk consumption or an increase in school milk waste.  (Sec. 744) Requires at least 10% of the funds provided by this bill for specified Rural Development programs to be allocated for assistance in persistent poverty counties. Defines a \"persistent poverty county\" as county that has had at least 20% of its population living in poverty over the past 30 years, as measured by the decennial censuses.  (Sec. 745) Prohibits USDA from including incarcerated prison populations to determine eligibility or the level of program assistance for Rural Development programs.  (Sec. 746) Prohibits funds provided by this bill from being used to influence congressional action on any legislation or appropriation matters pending before Congress, other than to communicate with Congress as permitted under current law.  (Sec. 747) Prohibits funds provided by this bill from be used for the variety requirements of the final USDA rule titled \"Enhancing Retailer Standards in the Supplemental Nutrition Assistance Program (SNAP)\" until USDA amends the definition of \"variety\" to increase the number of items that qualify as acceptable varieties in each staple food category so that the total number of such items in each staple food category exceeds the number of such items in each staple food category included in the final rule.  Specifies that, until the amendments are promulgated, USDA must apply the requirements regarding acceptable varieties and breadth of stock to SNAP retailers that were in effect on the day before the enactment of the Agricultural Act of 2014.  (Sec. 748) Prohibits the FDA from using funds provided by this bill to develop, issue, promote, or advance any regulations applicable to food manufacturers for population-wide sodium reduction actions or to develop, issue, promote or advance final guidance applicable to food manufacturers for long term population-wide sodium reduction actions until the dietary reference intake report with respect to sodium is completed.  (Sec. 749) Permits USDA to receive access to certain information from federal tax returns to verify the income for individuals participating in loan programs under the Housing Act of 1949.  (Sec. 750) Rescinds specified unobligated balances of funds provided to carry out the Rural Energy Savings Program.  (Sec. 751) Prohibits funds from being used to lower the de minimis quantity of swap dealing established under the Commodity Exchange Act below $8 billion.  (Sec. 752) Prohibits the FDA from using funds provided by this bill to implement, administer, or enforce, the final \"deeming rule\" for tobacco products with respect to traditional large and premium cigars.  (The rule deems e-cigarettes, cigars, pipe tobacco, hookah tobacco, and other products, to meet the statutory definition of \"tobacco product\" and to, therefore, be subject to FDA's regulatory authority. Manufacturers of newly deemed tobacco products that are currently being marketed in the United States must file an application for premarket review with FDA.)  (Sec. 753) Prohibits the FDA from using funds to require manufacturers of e-cigarettes and other newly deemed tobacco products on the market prior to the effective date of the deeming rule from filing an application for premarket review with the FDA.  Requires the FDA to issue specified regulations regarding vapor products, including characterizing flavors and batteries. Specifies requirements for advertising, selling, and labeling of vapor products.  (Sec. 754) Prohibits USDA from using funds to finalize the proposed rule titled \"Eligibility of the People's Republic of China (PRC) to Export to the United States Poultry Products from Birds Slaughtered in the PRC\" unless USDA meets specified requirements, including ensuring that the poultry slaughter inspection system for the PRC is equivalent to that of the United States.  (Sec. 755) Prohibits USDA from using funds, or providing funds to the Department of Defense (DOD), to purchase, produce, or defray the costs of the purchase or production of, or develop, facilitate, expedite, or expand production of, an alternative fuel for DOD.  (Sec. 756) Prohibits funds provided by this bill from being used for further implementation of the coastal and marine spatial planning and ecosystem-based management components of the National Ocean Policy.  (Sec. 757) Provides specified funds to the FDA to carry out provisions of the 21st Century Cures Act regarding FDA Innovation Projects.  (Sec. 758) Provides additional funds to APHIS to remain available through FY2019 for one-time control and management and associated activities directly related to the multiple-agency response to citrus greening.  (Sec. 759) Provides additional funds to USDA for loans and grants that are consistent with the Healthy Food Financing Initiative and that support projects to provide access to healthy food in underserved areas, create and preserve quality jobs, and revitalize low-income communities.  (Sec. 760) Enacts section 202 (consideration by the Commodity Futures Trading Commission of the costs and benefits of its regulations and orders) and section 320 (treatment of transactions between affiliates) of H.R. 238 (Commodity End-User Relief Act), as passed by the House of Representatives on January 12, 2017, with a specified technical correction.  (Sec. 761) Establishes a spending reduction account for the amount by which spending proposed in this bill exceeds the subcommittee's allocation under the Congressional Budget Act of 1974. Specifies that the amount is $0. (Under the Rules of the House of Representatives, any savings included in the spending reduction account are not available for further appropriation during consideration of the bill.) ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Highlights:  This bill provides FY2018 appropriations for the Department of Agriculture (USDA), except for the Forest Service which is included in the Department of the Interior, Environment, and Related Agencies appropriations bill.  It also provides appropriations for the Food and Drug Administration (FDA), the Commodity Futures Trading Commission (CFTC), and th...",
         "versions":[
],
         "actions":[
         {
           "id": 2,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-07-17",
           "description": "Placed on the Union Calendar, Calendar No. 165."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-07-17",
           "description": "The House Committee on Appropriations reported an original measure, H. Rept. 115-232, by Mr. Aderholt."
         }
         ],
         "votes": [
         ]

      }
   ]
}
