{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr353-115",
         "bill_slug": "hr353",
         "congress": "115",
         "bill": "H.R.353",
         "bill_type": "hr",
         "number": "H.R.353",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr353.json",
         "title": "Weather Research and Forecasting Innovation Act of 2017",
         "short_title": "Weather Research and Forecasting Innovation Act of 2017",
         "sponsor_title": "Rep.",
         "sponsor": "Frank D. Lucas",
         "sponsor_id": "L000491",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/L000491.json",
         "sponsor_party": "R",
         "sponsor_state": "OK",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr353rds/pdf/BILLS-115hr353rds.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/353",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr353",
         "introduced_date": "2017-01-06",
         "active": true,
         "house_passage": "2017-01-08",
         "senate_passage": "2017-03-28",
         "enacted": "2017-04-05",
         "vetoed": null,
         "cosponsors": 6,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Science, Technology, Communications",
         "committees": "House Science, Space, and Technology Committee",
         "committee_codes": ["HSSY"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-04-18",
         "latest_major_action": "Became Public Law No: 115-25.",
         "last_vote_date": null,
         "house_passage_vote": "2017-01-08",
         "senate_passage_vote": "2017-03-28",
         "summary": "(This measure has not been amended since it was passed by the Senate on March 29, 2017. The summary of that version is repeated here.) Weather Research and Forecasting Innovation Act of 2017 TITLE I--UNITED STATES WEATHER RESEARCH AND FORECASTING IMPROVEMENT (Sec.101)This bill requires the National Oceanic and Atmospheric Administration (NOAA) to prioritize weather research to improve weather data, modeling, computing, forecasts, and warnings for the protection of life and property and the enhancement of the national economy. (Sec. 102) NOAA's Office of Oceanic and Atmospheric Research (OAR) must conduct a program to develop an improved understanding of forecast capabilities for atmospheric events and their impacts, with priority given to the development of more accurate, timely, and effective warnings and forecasts of high impact weather events that endanger life and property. In carrying out the program, the OAR must collaborate with and support the nonfederal weather research community by making funds available through competitive grants, contracts, and cooperative agreements. Congress urges that at least 30% of the funds authorized for research and development be made available for this purpose. (Sec.103)NOAA must establish a tornado warning improvement and extension program to reduce the loss of life and economic losses from tornadoes through the development and extension of accurate, effective, and timely tornado forecasts, predictions, and warnings, including the prediction of tornadoes beyond one hour in advance. (Sec.104)In collaboration with the U.S. weather industry and appropriate academic entities, and through the National Weather Service (NWS), NOAA must plan and maintain a project to improve hurricane forecasting, including:  the prediction of rapid intensification and track of hurricanes, the forecast and communication of storm surges from hurricanes, and risk communication research to create more effective watch and warning products.   (Sec.105)The OAR must issue a research and development and research to operations plan to restore and maintain U.S. leadership in numerical weather prediction (processing weather data with computer models) and forecasting.  (Sec.106)NOAA must: (1) prioritize observation data requirements necessary to ensure weather forecasting capabilities to protect life and property to the maximum extent practicable; (2) evaluate observing systems, data, and information needed to meet those requirements; (3) identify data gaps in observing capabilities; and (4) determine a range of options to address those gaps. (Sec.107)The OAR must undertake Observing System Simulation Experiments (OSSE) to assess the value and benefits of observing capabilities and systems.  OSSEs must be conducted before: (1) acquisition of major government-owned or government-leased operational observing systems with a lifecycle cost of more than $500 million, and (2) purchase of any major new commercially provided data with a lifecycle cost of more than $500 million.   The OAR must complete an OSSE to assess the value of data from Global Navigation Satellite System Radio Occultation and from a geostationary hyperspectral sounder global constellation. (Sec.108)The bill requires an annual report on NOAA computing priorities and upgrades as they relate to weather prediction. (Sec.109)The U.S. Weather Research Program must: (1) report annually to Congress about on-going research projects and the five NOAA projects related to observations, weather, or subseasonal forecasts closest to operationalization; (2) establish teams with staff from the OAR and the NWS to oversee the operationalization of research projects; (3)develop mechanisms for research priorities of the OAR; (4)develop a system to track research goals; (5)provide testing facilities; and (6) facilitate visiting scholars. (Sec.110)The bill authorizes through FY2018: (1) the OAR's weather laboratories and cooperative institutes and weather and air chemistry research programs, and (2) a joint technology transfer initiative.  TITLE II--SUBSEASONAL AND SEASONAL FORECASTING INNOVATION (Sec.201)The NWSmust collect and utilize information to make reliable and timely foundational forecasts of subseasonal and seasonal temperature and precipitation. Subseasonal forecasting is forecasting weather between two weeks and three months and seasonal forecasting is between three months and two years. TITLE III--WEATHER SATELLITE AND DATA INNOVATION (Sec.301)NOAA must complete and operationalize the Constellation Observing System for Meteorology, Ionosphere, and Climate (a weather satellite program which develops observational techniques using global navigation systems). (Sec.302)The bill permits the purchase of weather data by the federal government through contracts with commercial providers and the placement of weather satellite instruments on co-hosted government or private payloads. (Sec.303)NOAA must avoid unnecessary duplication between public and private sources of data and the corresponding expenditure of funds and employment of personnel. TITLE IV--FEDERAL WEATHER COORDINATION (Sec.401)The NOAA Science Advisory Board must continue to maintain the Environmental Information Services Working Group. Membership requirements and reporting requirements for the group are established.  (Sec.402)The Office of Science and Technology Policy must establish an Inter-agency Committee for Advancing Weather Services to improve coordination of relevant weather research and forecast innovation activities.  (Sec.403)The OAR and the NWS may establish a program to detail their personnel to each other with the goal of enhancing forecasting innovation through regular, direct interaction between OAR scientists and NWS operational staff. (Sec.404)The NWS may establish a program to host postdoctoral fellows and academic researchers at the National Centers for Environmental Prediction.  (Sec.405)The NWS must designate warning coordination meteorologists at each of its weather forecast offices. (Sec.406)NOAA must conduct an evaluation of its system for issuing watches and warning regarding hazardous weather and water events. (Sec.407)The NWS may establish the NOAA Weather Ready All Hazards Award Program.The program must provide annual awards to individuals or organizations that use NOAA Weather Radio All Hazards receivers or transmitters to save lives and protect property. (Sec.408)NOAA must analyze the impacts of the proposed Air Force divestiture in the U.S. Weather Research and Forecasting Model, including the impact on:   U.S. weather forecasting capabilities, the accuracy of civilian regional forecasts, the civilian readiness for traditional and extreme weather events in the United States, and the research necessary to develop the Weather Research and Forecasting Model.   (Sec.409)NOAA must contract or continue to partner with an external organization to conduct a baseline analysis of the NWS operations and workforce.  (Sec.410)NOAA must submit a report to Congress on the use of contract employees at the NWS. (Sec.411)The NWS must review existing research, products, and services that meet the specific needs of the urban environment, including those with the potential for improving modeling and forecasting capabilities by taking into account factors such as varying building heights, impermeable surfaces, lack of tree canopy, traffic pollution, and inter-building wind effects. (Sec.412)NOAA may establish mechanisms for outreach to:(1)assess the weather forecasts and forecast products provided by NOAA, and (2)determine the highest priority weather forecast needs of specific communities. (Sec.413) NOAA must enter into one or more agreements with public and private entities to acquire backup for the WP-3D Orion and G-IV hurricane aircraft that is sufficient to prevent a single point of failure. NOAA must continue the development of the Airborne Phased Array Radar under the U.S. Weather Research Program. (Sec.414)The Department of Commerce must complete a study, within 180 days of the enactment of this bill, on gaps in the coverage of the NWS's Next Generation Weather Radar. Additionally, Commerce must submit recommendations to Congress for improving hazardous weather detection and forecasting coverage in areas of the United States where limited or no Next Generation Weather Radar coverage has resulted in insufficient warnings or degraded forecasts for hazardous weather events. TITLE V--TSUNAMI WARNING, EDUCATION, AND RESEARCH ACT OF 2017 Tsunami Warning, Education, and Research Act of 2017 The bill also revises and reauthorizes through FY2021 the Tsunami Warning and Education Act. (Sec.504) The tsunami warning systems for the Pacific and Arctic Oceans and for the Atlantic Ocean are consolidated into a single warning system.The system must support international tsunami forecasting and warning efforts. NOAA must support or maintain tsunami warning centers to support the national warning system and develop uniform operational procedures for the centers.Warning centers are given additional responsibilities, including maintaining a fail-safe warning capability and an ability to perform back-up duties for each other. (Sec.505) The tsunami hazard mitigation program must provide for:(1)technical and financial assistance; (2)activities to support the development of regional hazard and risk assessments; (3)activities to promote preparedness in at-risk ports and harbors; and (4)dissemination of guidelines and standards for community planning, education, and training products, programs, and tools. (Sec.506) The tsunami research program must develop the technical basis for validation of tsunami maps, models, and forecasts. NOAA no longer has to operate an International Tsunami Information Center to improve tsunami preparedness for Pacific Ocean nations. (Sec.508) NOAA must:(1)designate an existing working group to serve as the Tsunami Science and Technology Advisory Panel to provide advice on matters regarding tsunami science, technology, and regional preparedness; (2)maintain a coordinating committee to assist in the national tsunami hazard mitigation program; and (3)develop formal outreach activities to improve tsunami education and awareness and foster the development of resilient communities.",
         "summary_short": "(This measure has not been amended since it was passed by the Senate on March 29, 2017. The summary of that version is repeated here.) Weather Research and Forecasting Innovation Act of 2017 TITLE I--UNITED STATES WEATHER RESEARCH AND FORECASTING IMPROVEMENT (Sec.101)This bill requires the National Oceanic and Atmospheric Administration (NOAA) to prioritize weather research to improve weather data, modeling, computing, forecasts, and warnings for the protection of life and property and the en...",
         "versions":[
],
         "actions":[
         {
           "id": 17,
           "chamber": null,
           "action_type": "President",
           "datetime": "2017-04-18",
           "description": "Became Public Law No: 115-25."
         },
                  {
           "id": 16,
           "chamber": null,
           "action_type": "President",
           "datetime": "2017-04-18",
           "description": "Signed by President."
         },
                  {
           "id": 15,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-04-06",
           "description": "Presented to President."
         },
                  {
           "id": 14,
           "chamber": "House",
           "action_type": "ResolvingDifferences",
           "datetime": "2017-04-04",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 13,
           "chamber": "House",
           "action_type": "ResolvingDifferences",
           "datetime": "2017-04-04",
           "description": "On motion that the House suspend the rules and agree to the Senate amendment Agreed to by voice vote. (consideration: CR H2653-2667; text as House agreed to Senate amendment: CR H2653-2663)"
         },
                  {
           "id": 12,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-04-04",
           "description": "DEBATE - The House proceeded with forty minutes of debate on the Senate amendment to H.R. 353."
         },
                  {
           "id": 11,
           "chamber": "House",
           "action_type": "ResolvingDifferences",
           "datetime": "2017-04-04",
           "description": "Mr. Smith (TX) moved that the House suspend the rules and agree to the Senate amendment."
         },
                  {
           "id": 10,
           "chamber": "Senate",
           "action_type": "Floor",
           "datetime": "2017-03-30",
           "description": "Message on Senate action sent to the House."
         },
                  {
           "id": 9,
           "chamber": "Senate",
           "action_type": "Floor",
           "datetime": "2017-03-29",
           "description": "Passed Senate with an amendment by Unanimous Consent."
         },
                  {
           "id": 8,
           "chamber": "Senate",
           "action_type": "Floor",
           "datetime": "2017-03-29",
           "description": "Measure laid before Senate by unanimous consent. (consideration: CR S2115-2116)"
         },
                  {
           "id": 7,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-01-10",
           "description": "Received in the Senate, read twice."
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-09",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-09",
           "description": "On motion to suspend the rules and pass the bill Agreed to by voice vote. (text: CR H208-214)"
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-09",
           "description": "DEBATE - The House proceeded with forty minutes of debate on H.R. 353."
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-09",
           "description": "Considered under suspension of the rules. (consideration: CR H208-217)"
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-09",
           "description": "Mr. Lucas moved to suspend the rules and pass the bill."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "IntroReferral",
           "datetime": "2017-01-06",
           "description": "Referred to the House Committee on Science, Space, and Technology."
         }
         ],
         "votes": [
         ]

      }
   ]
}
