{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr599-115",
         "bill_slug": "hr599",
         "congress": "115",
         "bill": "H.R.599",
         "bill_type": "hr",
         "number": "H.R.599",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr599.json",
         "title": "Federal Communications Commission Consolidated Reporting Act of 2017",
         "short_title": "Federal Communications Commission Consolidated Reporting Act of 2017",
         "sponsor_title": "Rep.",
         "sponsor": "Steve Scalise",
         "sponsor_id": "S001176",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/S001176.json",
         "sponsor_party": "R",
         "sponsor_state": "LA",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr599rfs/pdf/BILLS-115hr599rfs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/599",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr599",
         "introduced_date": "2017-01-23",
         "active": true,
         "house_passage": "2017-01-22",
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 2,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Science, Technology, Communications",
         "committees": "Senate Commerce, Science, and Transportation Committee",
         "committee_codes": ["SSCM","HSIF"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-01-24",
         "latest_major_action": "Received in the Senate and Read twice and referred to the Committee on Commerce, Science, and Transportation.",
         "last_vote_date": null,
         "house_passage_vote": "2017-01-22",
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Federal Communications Commission Consolidated Reporting Act of 2017 (Sec. 2) This bill amends the Communications Act of 1934 to replace various reporting requirements with a communications marketplace report that the Federal Communications Commission (FCC) must publish on its website and submit to Congress every two years assessing: (1) competition in the communications marketplace; (2) deployment of communications capabilities, including whether advanced telecommunications capability is being deployed to all Americans in a reasonable and timely fashion; and (3) whether laws, regulations, or regulatory practices pose a barrier to competitive entry or expansion of existing providers of communications services. The report must describe the FCC's actions in the marketplace and its agenda for the next two years. The FCC must: (1) compile a list of geographic areas that are not served by any provider of advanced telecommunications capability; and (2) consider market entry barriers for entrepreneurs and small businesses in accordance with national policy favoring diversity of media voices, competition, technological advancement, and promotion of the public interest, convenience, and necessity.  The FCC's competition assessments must include the aggregate average total amount paid by cable systems for retransmission consent.  (Sec. 3) The bill repeals or consolidates various reports of the FCC and the Corporation for Public Broadcasting, including reports on satellite competition, international broadband, video programming, cable industry prices, small business entry barriers, commercial mobile radio, services to minority and diverse audiences, waivers from requirements prohibiting FCC employees from being financially interested in companies subject to FCC regulation, and several other existing reports.  The Telecommunications Act of 1996 is amended to require the FCC to determine from the communications marketplace report every two years (currently, in an inquiry initiated each year) whether it must act immediately to accelerate deployment of advanced telecommunications capabilities, particularly in elementary and secondary schools, by removing barriers to infrastructure investment and promoting competition.",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Federal Communications Commission Consolidated Reporting Act of 2017 (Sec. 2) This bill amends the Communications Act of 1934 to replace various reporting requirements with a communications marketplace report that the Federal Communications Commission (FCC) must publish on its website and submit to Congress every two years assessing: (1) competition in the communi...",
         "versions":[
],
         "actions":[
         {
           "id": 7,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-01-24",
           "description": "Received in the Senate and Read twice and referred to the Committee on Commerce, Science, and Transportation."
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-23",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-23",
           "description": "On motion to suspend the rules and pass the bill Agreed to by voice vote. (text of measure as passed: CR H586-587)"
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-23",
           "description": "DEBATE - The House proceeded with forty minutes of debate on H.R. 599."
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-23",
           "description": "Considered under suspension of the rules. (consideration: CR H586-588)"
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-23",
           "description": "Mr. Lance moved to suspend the rules and pass the bill."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "IntroReferral",
           "datetime": "2017-01-23",
           "description": "Referred to the House Committee on Energy and Commerce."
         }
         ],
         "votes": [
         ]

      }
   ]
}
