{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr985-115",
         "bill_slug": "hr985",
         "congress": "115",
         "bill": "H.R.985",
         "bill_type": "hr",
         "number": "H.R.985",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr985.json",
         "title": "Fairness in Class Action Litigation and Furthering Asbestos Claim Transparency Act of 2017",
         "short_title": "Fairness in Class Action Litigation Act of 2017",
         "sponsor_title": "Rep.",
         "sponsor": "Robert W. Goodlatte",
         "sponsor_id": "G000289",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/G000289.json",
         "sponsor_party": "R",
         "sponsor_state": "VA",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr985rfs/pdf/BILLS-115hr985rfs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/985",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr985",
         "introduced_date": "2017-02-09",
         "active": true,
         "house_passage": "2017-03-08",
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 2,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Law",
         "committees": "Senate Judiciary Committee",
         "committee_codes": ["SSJU","HSJU"],
         "subcommittee_codes": ["HSJU10"],
         "latest_major_action_date": "2017-03-13",
         "latest_major_action": "Received in the Senate and Read twice and referred to the Committee on the Judiciary.",
         "last_vote_date": "2017-03-09",
         "house_passage_vote": "2017-03-08",
         "senate_passage_vote": null,
         "summary": "Fairness in Class Action Litigation and Furthering Asbestos Claim Transparency Act of 2017 TITLE I--FAIRNESS IN CLASS ACTION LITIGATION Fairness in Class Action Litigation Act of 2017 (Sec. 103) This bill amends the federal judicial code to prohibit federal courts from certifying class actions unless:   in a class action seeking monetary relief for personal injury or economic loss, each proposed class member suffered the same type and scope of injury as the named class representatives;  no class representatives or named plaintiffs are relatives of class counsel, except in a private securities litigation brought as a class action subject to the Securities Act of 1933 or the Securities Exchange Act of 1934; and  in a class action seeking monetary relief, the party seeking to maintain the class action demonstrates a reliable and administratively feasible mechanism for the court to determine whether putative class members fall within the class definition and for the distribution of any monetary relief directly to a substantial majority of class members.  Class counsel must disclose: (1) whether any proposed class representatives or named plaintiffs are relatives of, present or former employees or clients of, or contractually related to class counsel; (2) the circumstances under which such representatives or plaintiffs agreed to be included in the complaint; and (3) any other class action in which such representatives and plaintiffs have a similar role. The bill limits attorney's fees to a reasonable percentage of: (1) any payments received by class members, and (2) the value of any equitable relief.  No attorney's fees based on monetary relief may: (1) be paid until distribution of the monetary recovery to class members has been completed, or (2) exceed the total amount distributed to and received by all class members. Class counsel must submit to the Federal Judicial Center and the Administrative Office of the U.S. Courts an accounting of the disbursement of funds paid by defendants in class action settlements. The Judicial Conference of the United States must use the accountings to prepare an annual summary for Congress and the public on how funds paid by defendants in class actions have been distributed to class members, class counsel, and other persons. A court's order that certifies a class with respect to particular issues must include a determination that the entirety of the cause of action from which the particular issues arise satisfies all the class certification prerequisites. Except in certain private securities actions, a stay of discovery is required during the pendency of preliminary motions in class action proceedings (motions to transfer, dismiss, strike, or dispose of class allegations) unless the court finds upon the motion of a party that particularized discovery is necessary to preserve evidence or to prevent undue prejudice.  Class counsel must disclose any person or entity who has a contingent right to receive compensation from any settlement, judgment, or relief obtained in the action.  Appeals courts must permit appeals from an order granting or denying class certification.  (Sec. 104) Federal courts must apply diversity of citizenship jurisdictional requirements to the claims of each plaintiff individually (as though each plaintiff were the sole plaintiff in the action) when deciding a motion to remand back to a state court a civil action in which: (1) two or more plaintiffs assert personal injury or wrongful death claims, (2) the action was removed from state court to federal court on the basis of a diversity of citizenship among the parties, and (3) a motion to remand is made on the ground that one or more defendants are citizens of the same state as one or more plaintiffs.  A court must sever, and remand to state court, claims that do not satisfy the diversity jurisdictional requirements unless: (1) a claim is so related to claims that satisfy the diversity requirements that they form part of the same case or controversy under Article III of the Constitution, and (2) the plaintiff consents to the removal from state to federal court. The court must retain jurisdiction over claims that satisfy the diversity requirements. (Sec. 105) In coordinated or consolidated pretrial proceedings for personal injury claims conducted by judges assigned by the judicial panel on multidistrict litigation, plaintiffs must: (1) submit medical records and other evidence for factual contentions regarding the alleged injury, the exposure to the risk that allegedly caused the injury, and the alleged cause of the injury; and (2) receive not less than 80% of any monetary recovery obtained for those claims, subject to the satisfaction of any liens for medical services provided to the plaintiff related to those claims. Trials may not be conducted in multidistrict litigation proceedings unless all parties to that civil action consent. A federal appeals court having jurisdiction over the transferee district shall permit an appeal from an order issued in coordinated or consolidated pretrial proceedings if: (1) the order is applicable to one or more civil actions seeking redress for personal injury, and (2) an immediate appeal may materially advance the ultimate termination of one or more civil actions in the proceedings.  A federal appeals court may accept an appeal from an order issued in any coordinated or consolidated proceedings granting or denying a motion to remand a civil action to the state court from which it was removed if application is made within 14 days after the order is entered. TITLE II--FURTHERING ASBESTOS CLAIM TRANSPARENCY Furthering Asbestos Claim Transparency (FACT) Act of 2017 (Sec. 202) This title amends the federal bankruptcy code to require asbestos liability trusts to disclose information about claimant demands and payments from the trusts by: (1) filing with the bankruptcy court quarterly reports to be available on the public docket, (2) providing the information upon request to parties in actions concerning liability for asbestos exposure. (A bankruptcy court, in confirming a debtor's chapter 11 bankruptcy reorganization plan, may prohibit entities seeking payment for alleged asbestos damages from taking legal action against a reorganized debtor if the court authorizes a debtor-funded trust to assume the debtor's asbestos liability and serve as asbestos-claimants' exclusive source of compensation.) ",
         "summary_short": "Fairness in Class Action Litigation and Furthering Asbestos Claim Transparency Act of 2017 TITLE I--FAIRNESS IN CLASS ACTION LITIGATION Fairness in Class Action Litigation Act of 2017 (Sec. 103) This bill amends the federal judicial code to prohibit federal courts from certifying class actions unless:   in a class action seeking monetary relief for personal injury or economic loss, each proposed class member suffered the same type and scope of injury as the named class representatives;  no cl...",
         "versions":[
],
         "actions":[
         {
           "id": 36,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-03-13",
           "description": "Received in the Senate and Read twice and referred to the Committee on the Judiciary."
         },
                  {
           "id": 35,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 34,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "On passage Passed by recorded vote: 220 - 201, 1 Present (Roll no. 148)."
         },
                  {
           "id": 33,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "On motion to recommit with instructions Failed by recorded vote: 188 - 234 (Roll no. 147)."
         },
                  {
           "id": 32,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "The previous question on the motion to recommit with instructions was ordered without objection."
         },
                  {
           "id": 31,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - The House proceeded with 10 minutes of debate on the Kildee motion to recommit with instructions. The instructions contained in the motion seek to report the bill back to the House with an amendment to add an exemption for any civil action brought forward to protect drinking water supplies."
         },
                  {
           "id": 30,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "Mr. Kildee moved to recommit with instructions to the Committee on the Judiciary. (text: CR H1998)"
         },
                  {
           "id": 29,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "The House adopted the amendment in the nature of a substitute as agreed to by the Committee of the Whole House on the state of the Union. (consideration: CR H1981-1983)"
         },
                  {
           "id": 28,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "The previous question was ordered pursuant to the rule."
         },
                  {
           "id": 27,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 985."
         },
                  {
           "id": 26,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Espaillat amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Espaillat demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 25,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Espaillat amendment No. 8."
         },
                  {
           "id": 24,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 23,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson Lee amendment No. 7."
         },
                  {
           "id": 22,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Conyers amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Conyers demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 21,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Conyers amendment No. 6."
         },
                  {
           "id": 20,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Johnson(GA) amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Johnson (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 19,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Johnson (GA) amendment No. 5."
         },
                  {
           "id": 18,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Soto amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Soto demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 17,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Soto amendment No. 4."
         },
                  {
           "id": 16,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Deutch amendment No. 3, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Deutch demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 15,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Deutch amendment No. 3."
         },
                  {
           "id": 14,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Deutch amendment No. 2, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Deutch demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 13,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Deutch amendment No. 2."
         },
                  {
           "id": 12,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 180, the Committee of the Whole proceeded with 10 minutes of debate on the Goodlatte amendment No. 1."
         },
                  {
           "id": 11,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 985."
         },
                  {
           "id": 10,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "The Speaker designated the Honorable Michael K. Simpson to act as Chairman of the Committee."
         },
                  {
           "id": 9,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 180 and Rule XVIII."
         },
                  {
           "id": 8,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "Providing for consideration of the bills H.R. 720 and H.R. 985."
         },
                  {
           "id": 7,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-09",
           "description": "Considered under the provisions of rule H. Res. 180. (consideration: CR H1974-2000)"
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-03-07",
           "description": "Placed on the Union Calendar, Calendar No. 11."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-03-07",
           "description": "Reported by the Committee on Judiciary. H. Rept. 115-25."
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-15",
           "description": "Ordered to be Reported by the Yeas and Nays: 19 - 12."
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-15",
           "description": "Committee Consideration and Mark-up Session Held."
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-10",
           "description": "Referred to the Subcommittee on the Constitution and Civil Justice."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "IntroReferral",
           "datetime": "2017-02-09",
           "description": "Referred to the House Committee on the Judiciary."
         }
         ],
         "votes": [
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:52:00",
             "roll_call": "148",
             "question": "On Passage",
             "result": "Passed",
             "total_yes": 220,
             "total_no": 201,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/148.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:46:00",
             "roll_call": "147",
             "question": "On Motion to Recommit with Instructions",
             "result": "Failed",
             "total_yes": 188,
             "total_no": 234,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/147.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:28:00",
             "roll_call": "146",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 193,
             "total_no": 228,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/146.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:25:00",
             "roll_call": "145",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 193,
             "total_no": 229,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/145.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:21:00",
             "roll_call": "144",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 191,
             "total_no": 230,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/144.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:18:00",
             "roll_call": "143",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 190,
             "total_no": 230,
             "total_not_voting": 9,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/143.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:15:00",
             "roll_call": "142",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 192,
             "total_no": 230,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/142.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:11:00",
             "roll_call": "141",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 189,
             "total_no": 228,
             "total_not_voting": 12,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/141.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-09",
             "time": "18:07:00",
             "roll_call": "140",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 182,
             "total_no": 227,
             "total_not_voting": 20,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/140.json"
           }
         ]

      }
   ]
}
