{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hr998-115",
         "bill_slug": "hr998",
         "congress": "115",
         "bill": "H.R.998",
         "bill_type": "hr",
         "number": "H.R.998",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hr998.json",
         "title": "SCRUB Act",
         "short_title": "SCRUB Act",
         "sponsor_title": "Rep.",
         "sponsor": "Jason Smith",
         "sponsor_id": "S001195",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/S001195.json",
         "sponsor_party": "R",
         "sponsor_state": "MO",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hr998rfs/pdf/BILLS-115hr998rfs.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-bill/998",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hr998",
         "introduced_date": "2017-02-09",
         "active": true,
         "house_passage": "2017-02-28",
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 3,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Government Operations and Politics",
         "committees": "Senate Homeland Security and Governmental Affairs Committee",
         "committee_codes": ["SSGA","HSGO","HSJU"],
         "subcommittee_codes": ["HSJU05"],
         "latest_major_action_date": "2017-03-02",
         "latest_major_action": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs.",
         "last_vote_date": "2017-03-01",
         "house_passage_vote": "2017-02-28",
         "senate_passage_vote": null,
         "summary": "Searching for and Cutting Regulations that are Unnecessarily Burdensome Act or the SCRUB Act TITLE I--RETROSPECTIVE REGULATORY REVIEW COMMISSION  (Sec. 101) This bill establishes the Retrospective Regulatory Review Commission to conduct a review of the Code of Federal Regulations to identify rules and sets of rules that collectively implement a regulatory program that should be repealed to lower the cost of regulation. The commission shall give priority to the review of rules or sets of rules that are major rules or that include major rules, that have been in effect more than 15 years, that impose paperwork burdens or unfunded mandates that could be reduced substantially without significantly diminishing regulatory effectiveness, that impose disproportionately high costs on small entities, or that could be strengthened in their effectiveness while reducing regulatory costs. The commission's goal is to achieve a reduction of at least 15% in the cumulative costs of regulation with a minimal reduction in the overall effectiveness of such regulation.  Criteria the commission shall use in identifying which rules and sets of rules should be repealed include whether:    the original purpose of the rules was achieved;  the implementation, compliance, administration, enforcement, imposition of unfunded mandates, or other costs of the rules are not justified by a cost-benefit analysis;  the rules have been rendered unnecessary or obsolete;  the rules are ineffective at achieving their purposes;  the rules overlap, duplicate, or conflict with other federal, state, or local rules;  the rules have excessive compliance costs, impose unfunded mandates, or are otherwise excessively burdensome compared to possible alternatives;  the rules inhibit innovation or harm competition;  the rules limit or prevent an agency from applying new or emerging technologies to improve efficiency and effectiveness of government;  the rules harm wage growth, including wage growth for minimum wage and part-time workers; the agency complied with Congressional Review Act requirements to submit the rules to Congress and the Government Accountability Office before the rules take effect; and a repeal would impact public health.  The commission shall terminate on the later of five years and 180 days after the enactment of this bill or five years after the date by which the terms of all members of the commission have commenced. The bill requires congressional consideration and enactment of a joint resolution of approval of recommendations of the commission for the repeal of a rule or rules prior to agency implementation of a repeal. An agency is prohibited from: (1) reissuing rules substantially similar to rules repealed by this bill without congressional approval, or (2) issuing a new rule that results in the same adverse effects of a repealed rule.   The commission shall establish a public website to provide information in a standard data format and shall receive and publish public comments at no cost to the public. The Federal Advisory Committee Act shall apply to the commission.  TITLE II--REGULATORY CUT-GO (Sec. 201) This title requires agencies, when making a new rule, to repeal rules or sets of rules classified by the commission as recommended for repeal to offset the costs of the new rule (cut-go procedure).  (Sec. 202) Agencies are exempted from cut-go requirements when the commission has implemented the repeal of all rules and sets of rules that the commission has recommended for repeal.  (Sec. 203) The Office of Information and Regulatory Affairs (OIRA) of the Office of Management and Budget shall review and certify the accuracy of agency determinations of the cost of new rules subject to cut-go requirements.  TITLE III--RETROSPECTIVE REVIEW OF NEW RULES (Sec. 301) This title requires an agency, when issuing a new rule, to include a plan for the review of such rule not later than 10 years after the date of such rule.  TITLE IV--JUDICIAL REVIEW  (Sec. 401) This title allows judicial review of repeals of regulations, cut-go procedures, and plans for future review.  TITLE V--MISCELLANEOUS PROVISIONS (Sec. 501) A \"major rule\" is defined to mean any rule that OIRA determines is likely to impose: (1) an annual cost on the economy of $100 million or more, adjusted annually for inflation; (2) a major increase in costs or prices for consumers, individual industries, federal, state, local, or tribal government agencies, or geographic regions; (3) significant adverse effects on competition, employment, investment, productivity, innovation, or the ability of U.S.-based enterprises to compete with foreign-based enterprises; or (4) significant impacts on multiple sectors of the economy. ",
         "summary_short": "Searching for and Cutting Regulations that are Unnecessarily Burdensome Act or the SCRUB Act TITLE I--RETROSPECTIVE REGULATORY REVIEW COMMISSION  (Sec. 101) This bill establishes the Retrospective Regulatory Review Commission to conduct a review of the Code of Federal Regulations to identify rules and sets of rules that collectively implement a regulatory program that should be repealed to lower the cost of regulation. The commission shall give priority to the review of rules or sets of rules...",
         "versions":[
],
         "actions":[
         {
           "id": 49,
           "chamber": "Senate",
           "action_type": "IntroReferral",
           "datetime": "2017-03-02",
           "description": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs."
         },
                  {
           "id": 48,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 47,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "On passage Passed by recorded vote: 240 - 185 (Roll no. 114)."
         },
                  {
           "id": 46,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "On motion to recommit with instructions Failed by recorded vote: 190 - 235 (Roll no. 113)."
         },
                  {
           "id": 45,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "The previous question on the motion to recommit with instructions was ordered without objection."
         },
                  {
           "id": 44,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "Floor summary: DEBATE - The House proceeded with 10 minutes of debate on the Raskin motion to recommit with instructions. The instructions contained in the motion seek to report the same back to the House with an amendment to add an exemption to the underlying bill for any rules pertaining to laws governing potential conflicts of interest of an employee or officer of the executive branch, financial disclosures of an employee or officer of the executive branch, or bribery."
         },
                  {
           "id": 43,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "Mr. Raskin moved to recommit with instructions to the Committee on Oversight and Government Reform. (text: CR 1417)"
         },
                  {
           "id": 42,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union."
         },
                  {
           "id": 41,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "The previous question was ordered pursuant to the rule."
         },
                  {
           "id": 40,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "The House rose from the Committee of the Whole House on the state of the Union to report H.R. 998."
         },
                  {
           "id": 39,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on adoption of amendments which had been debated earlier and on which further proceedings had been postponed."
         },
                  {
           "id": 38,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Cummings amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Cummings demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 37,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Cummings amendment No. 12."
         },
                  {
           "id": 36,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Moore amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Moore demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 35,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Moore amendment No. 11."
         },
                  {
           "id": 34,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Raskin amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Raskin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 33,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Raskin amendment No. 10."
         },
                  {
           "id": 32,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Bonamici amendment No. 9."
         },
                  {
           "id": 31,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Bonamici amendment, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Bonamici demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 30,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Bonamici amendment No. 8."
         },
                  {
           "id": 29,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "The House resolved into Committee of the Whole House on the state of the Union for further consideration."
         },
                  {
           "id": 28,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-03-01",
           "description": "Considered as unfinished business. (consideration: CR H1408-1419)"
         },
                  {
           "id": 27,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "Committee of the Whole House on the state of the Union rises leaving H.R. 998 as unfinished business."
         },
                  {
           "id": 26,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "On motion that the committee rise Agreed to by voice vote."
         },
                  {
           "id": 25,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "Mr. Sessions moved that the committee rise."
         },
                  {
           "id": 24,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "UNFINISHED BUSINESS - The Chair announced that the unfinished business was on amendments to H.R. 998, which had been debated earlier and on which further proceedings were postponed."
         },
                  {
           "id": 23,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Krishnamoorthi amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the noes had prevailed. Mr. Krishnamoorthi demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 22,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Krishnamoorthi amendment No. 7."
         },
                  {
           "id": 21,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Krishnamoorthi amendment No. 6."
         },
                  {
           "id": 20,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the McNerney amendment No. 5."
         },
                  {
           "id": 19,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the Plaskett amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Mr. Ross demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 18,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H. Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Plaskett amendment No. 4."
         },
                  {
           "id": 17,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the McSally amendment No. 3."
         },
                  {
           "id": 16,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "POSTPONED PROCEEDINGS - At the conclusion of debate on the DeSaulnier amendment, the Chair put the question on adoption of the amendment and by voice vote announced that the ayes had prevailed. Mr. DeSaulnier demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced."
         },
                  {
           "id": 15,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the DeSaulnier amendment No. 2."
         },
                  {
           "id": 14,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "DEBATE - Pursuant to the provisions of H.Res. 150, the Committee of the Whole proceeded with 10 minutes of debate on the Cummings amendment No. 1."
         },
                  {
           "id": 13,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 998."
         },
                  {
           "id": 12,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "The Speaker designated the Honorable Gary J. Palmer to act as Chairman of the Committee."
         },
                  {
           "id": 11,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 150 and Rule XVIII."
         },
                  {
           "id": 10,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "Provides for consideration of H.R. 998 and H.J.Res. 83."
         },
                  {
           "id": 9,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-28",
           "description": "Considered under the provisions of rule H. Res. 150. (consideration: CR H1370-1385; text as reported in House: CR H1373-1376)"
         },
                  {
           "id": 8,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-02-27",
           "description": "Rules Committee Resolution H. Res. 150 Reported to House. Provides for consideration of H.R. 998 and H.J.Res. 83."
         },
                  {
           "id": 7,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-02-21",
           "description": "Placed on the Union Calendar, Calendar No. 2."
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Discharge",
           "datetime": "2017-02-21",
           "description": "Committee on the Judiciary discharged."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-21",
           "description": "Reported by the Committee on Oversight and Government Reform. H. Rept. 115-14, Part I."
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-14",
           "description": "Ordered to be Reported by the Yeas and Nays: 22 - 17."
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-14",
           "description": "Committee Consideration and Mark-up Session Held."
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "IntroReferral",
           "datetime": "2017-02-09",
           "description": "Referred to the Committee on Oversight and Government Reform, and in addition to the Committee on the Judiciary, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-02-09",
           "description": "Referred to the Subcommittee on Regulatory Reform, Commercial And Antitrust Law."
         }
         ],
         "votes": [
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "15:07:00",
             "roll_call": "114",
             "question": "On Passage",
             "result": "Passed",
             "total_yes": 240,
             "total_no": 185,
             "total_not_voting": 4,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/114.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "15:00:00",
             "roll_call": "113",
             "question": "On Motion to Recommit with Instructions",
             "result": "Failed",
             "total_yes": 190,
             "total_no": 235,
             "total_not_voting": 4,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/113.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "14:36:00",
             "roll_call": "112",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 194,
             "total_no": 231,
             "total_not_voting": 4,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/112.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "14:32:00",
             "roll_call": "111",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 197,
             "total_no": 229,
             "total_not_voting": 3,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/111.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "14:27:00",
             "roll_call": "110",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 189,
             "total_no": 231,
             "total_not_voting": 9,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/110.json"
           },
           {
             "chamber": "House",
             "date": "2017-03-01",
             "time": "14:19:00",
             "roll_call": "109",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 191,
             "total_no": 235,
             "total_not_voting": 3,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/109.json"
           },
           {
             "chamber": "House",
             "date": "2017-02-28",
             "time": "16:22:00",
             "roll_call": "108",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 192,
             "total_no": 230,
             "total_not_voting": 8,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/108.json"
           },
           {
             "chamber": "House",
             "date": "2017-02-28",
             "time": "16:18:00",
             "roll_call": "107",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 189,
             "total_no": 234,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/107.json"
           },
           {
             "chamber": "House",
             "date": "2017-02-28",
             "time": "16:14:00",
             "roll_call": "106",
             "question": "On Agreeing to the Amendment",
             "result": "Failed",
             "total_yes": 181,
             "total_no": 243,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/106.json"
           },
           {
             "chamber": "House",
             "date": "2017-02-28",
             "time": "16:11:00",
             "roll_call": "105",
             "question": "On Agreeing to the Amendment",
             "result": "Agreed to",
             "total_yes": 348,
             "total_no": 75,
             "total_not_voting": 7,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/105.json"
           }
         ]

      }
   ]
}
