{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hres235-115",
         "bill_slug": "hres235",
         "congress": "115",
         "bill": "H.RES.235",
         "bill_type": "hres",
         "number": "H.RES.235",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hres235.json",
         "title": "Directing the Secretary of Homeland Security to transmit certain documents to the House of Representatives relating to the Department of Homeland Security's research, integration, and analysis activities relating to Russian Government interference in the elections for Federal office held in 2016.",
         "short_title": "Directing the Secretary of Homeland Security to transmit certain documents to the House of Representatives relating to the Department of Homeland Security's research, integration, and analysis activities relating to Russian Government interference in the ",
         "sponsor_title": "Rep.",
         "sponsor": "Bennie Thompson",
         "sponsor_id": "T000193",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/T000193.json",
         "sponsor_party": "D",
         "sponsor_state": "MS",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hres235rh/pdf/BILLS-115hres235rh.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-resolution/235",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hres235",
         "introduced_date": "2017-03-30",
         "active": true,
         "house_passage": null,
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 11,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Government Operations and Politics",
         "committees": "House Homeland Security Committee",
         "committee_codes": ["HSHM"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-04-07",
         "latest_major_action": "Placed on the House Calendar, Calendar No. 40.",
         "last_vote_date": null,
         "house_passage_vote": null,
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary of that version is repeated here.) Directs the Department of Homeland Security (DHS) to transmit to the House of Representatives copies of any document, correspondence, or other communication of DHS that refers or relates to:  DHS research, integration, and analysis activities relating to interference with the 2016 elections by or at the direction of the Russian government, as announced in a joint statement with the Office of the Director of National Intelligence on October 7 and December 29, 2016;  dissemination by DHS of information regarding such interference, as announced in such statement;  research into cyber compromises of email of U.S. persons and institutions by or at the direction of the Russian government to interfere with such elections; and integration, analysis, and dissemination of the Joint Analysis Report detailing the tools and infrastructure used by Russian intelligence services to compromise and exploit networks and infrastructure associated with such elections issued by DHS and the Federal Bureau of Investigation on December 29, 2016.    ",
         "summary_short": "(This measure has not been amended since it was introduced. The summary of that version is repeated here.) Directs the Department of Homeland Security (DHS) to transmit to the House of Representatives copies of any document, correspondence, or other communication of DHS that refers or relates to:  DHS research, integration, and analysis activities relating to interference with the 2016 elections by or at the direction of the Russian government, as announced in a joint statement with the Offic...",
         "versions":[
],
         "actions":[
         {
           "id": 3,
           "chamber": "House",
           "action_type": "Calendars",
           "datetime": "2017-04-07",
           "description": "Placed on the House Calendar, Calendar No. 40."
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Committee",
           "datetime": "2017-04-07",
           "description": "Reported adversely by the Committee on Homeland Security. H. Rept. 115-89."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "IntroReferral",
           "datetime": "2017-03-30",
           "description": "Referred to the House Committee on Homeland Security."
         }
         ],
         "votes": [
         ]

      }
   ]
}
