{
   "status":"OK",
   "copyright":"Copyright (c) 2017 Pro Publica Inc. All Rights Reserved.",
   "results":[
      {
         "bill_id": "hres5-115",
         "bill_slug": "hres5",
         "congress": "115",
         "bill": "H.RES.5",
         "bill_type": "hres",
         "number": "H.RES.5",
         "bill_uri": "https://api.propublica.org/congress/v1/115/bills/hres5.json",
         "title": "Adopting rules for the One Hundred Fifteenth Congress.",
         "short_title": "Adopting rules for the One Hundred Fifteenth Congress.",
         "sponsor_title": "Rep.",
         "sponsor": "Kevin McCarthy",
         "sponsor_id": "M001165",
         "sponsor_uri": "https://api.propublica.org/congress/v1/members/M001165.json",
         "sponsor_party": "R",
         "sponsor_state": "CA",
         "gpo_pdf_uri": "https://www.gpo.gov/fdsys/pkg/BILLS-115hres5eh/pdf/BILLS-115hres5eh.pdf",
         "congressdotgov_url": "https://www.congress.gov/bill/115th-congress/house-resolution/5",
         "govtrack_url": "https://www.govtrack.us/congress/bills/115/hres5",
         "introduced_date": "2017-01-03",
         "active": true,
         "house_passage": "2017-01-02",
         "senate_passage": null,
         "enacted": null,
         "vetoed": null,
         "cosponsors": 0,
         "withdrawn_cosponsors": 0,
         "primary_subject": "Congress",
         "committees": "",
         "committee_codes": ["HSRU"],
         "subcommittee_codes": [],
         "latest_major_action_date": "2017-01-03",
         "latest_major_action": "Motion to reconsider laid on the table Agreed to without objection.",
         "last_vote_date": "2017-01-03",
         "house_passage_vote": "2017-01-02",
         "senate_passage_vote": null,
         "summary": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Adopts the Rules of the House of Representatives for the 114th Congress as the Rules for the 115th Congress, with amendments. (Sec. 2) Directs the Sergeant-at-Arms to impose a fine against a Member, Delegate, or Resident Commissioner for use of an electronic device for still photography or for audio or visual recording or broadcasting in contravention of clause 5 of Rule XVII and any applicable Speaker of the House of Representatives' announced policy on electronic devices.  Prohibits a Member, Delegate, Resident Commissioner or a House officer or employee from engaging in disorderly or disruptive conduct in the chamber, including by:   intentionally obstructing or impeding the passage of others;  using an exhibit to impede, disrupt, or disturb House proceedings; and denying legislative instruments to others seeking to engage in legislative proceedings.  Amends current oversight plan requirements. Requires each standing committee, excluding the Committees on Appropriations, Ethics, and Rules, to adopt and submit to the Appropriations Committee, (in addition to the Oversight and Government Reform and House Administration Committees) by February 15 of the first session of a Congress an authorization and oversight plan (currently, oversight plan) for that Congress. Requires the plan's content to include:  a list of such programs or agencies with lapsed authorizations that received funding in the prior fiscal year or, in the case of a permanent authorization, that have not been subject to a comprehensive review by the committee in the prior three Congresses;  description of each such program or agency to be authorized in the current or next Congress;  a description of any oversight to support the authorization of each such program or agency in the current Congress; and recommendations for changes to existing law for moving it from mandatory funding to discretionary appropriations.  Authorizes the plan to include:  recommendations for consolidation or termination of such programs or agencies that are duplicative, unnecessary, or inconsistent with the appropriate federal roles and responsibilities; and recommendations for changes to existing law related to federal rules, regulations, statutes, and court decisions affecting them inconsistent with Congress's authorities under the U.S. Constitution.  Directs the Committee on Oversight and Government Reform to report the authorization and oversight plans to the House by March 31 in the first session of a Congress. Requires the summary of a committee's activities' report submitted to the House by January 2 of each odd-numbered year to include its: (1) authorization and oversight plans, and (2) actions taken and recommendations made with respect to them. Prohibits an amendment to a general appropriation bill from being in order if the amendment proposes a net increase in the bill's level of budget authority. Requires a committee report on a measure to include for a bill or joint resolution that establishes or reauthorizes a federal program, a statement indicating whether the program is duplicative of another program, including at a minimum an explanation of whether it was included in a congressional report or whether the most recent Catalog of Federal Domestic Assistance identified other programs related to it. Permits Members to be recognized either by sitting or standing with respect to Floor proceedings. Authorizes the Speaker to convene the House in a place at the seat of government, other than the Hall of the House if in the Speaker's opinion, the public interest shall warrant it. Requires the Clerk, pending the election of a Speaker or Speaker pro tempore and in the absence of a Member acting as Speaker pro tempore, to preserve order and decorum and decide all questions of order, subject to appeal by a Member, Delegate, or Resident Commissioner. Authorizes the House, the Speaker, a committee or the chair of a committee authorized during a prior Congress to act in a litigation matter as the successor in such individual's or committee's interest, respectively, regarding the litigation matter, and to take such steps as may be appropriate to ensure the matter's continuation. Provides access to the Hall of the House or a room leading to it by a person from the staff of a Member, Delegate, Resident Commissioner, or committee responsible for such individual's admission. (Currently, the staff must remain at the desk). Makes records created, generated, or received by the congressional office of a Member, Delegate, or Resident Commissioner in the performance of official duties exclusively such individual's personal property. Gives control over the records to the individual. Modifies procedures governing notification of, and response to, properly served judicial subpoena and judicial orders directing appearance as a witness relating to the official House functions or compelling the production or disclosure of any document relating to such functions. Eliminates administrative subpoenas from these procedures. Waives Rule X, clause 5(d) to allow extra subcommittees for the House Committees on: (1) Armed Services, (2) Foreign Affairs, (3) Transportation and Infrastructure, and (4) Agriculture. Authorizes the Committee on Homeland Security to close hearings for an additional five consecutive days when considering sensitive matters that require an executive session. Refers measures making a referral to the Court of Claims to the private calendar. Modifies the Ramseyer Rule (requiring committee reports on bills and joint resolutions to show exactly how a bill would change existing law). Requires the committee report or an accompanying document (showing by appropriate typographical devices the omissions and insertions proposed) to show:  the entire text of each section of a statute proposed to be repealed, and a comparative print of each amendment to the entire text of a section of a statute that the measure proposes to make.  Authorizes the Speaker to postpone record votes on the question of adopting a motion: (1) to recommit, and (2) to concur in a Senate amendment, with or without amendment. Revises guidelines for the minimum five-minute electronic voting to allow the Speaker, if in the Speaker's discretion, Members would be afforded an adequate opportunity to vote (as under the current rule):  on any question arising after a report from the Committee of the Whole without debate or intervening motion, or on the question of adoption of a motion to recommit (or ordering the previous question) arising without intervening motion or debate other than debate on the motion.  Considers a measure or matter that is publicly available at an electronic document repository operated by the Clerk as having been available to Members, Delegates, and the Resident Commissioner for purposes of the House Rules. Requires, effective December 31, 2017:   before a bill, joint resolution, or an amendment in the nature of a substitute proposing to repeal or amend a statute may be considered, its availability on a House public website in an easily searchable electronic comparative print showing how the legislation proposes to change current law (by appropriate typographical devices the omissions and insertions proposed); and  before a measure can be considered with text different from its committee report, the differences between the legislation's text as proposed to be considered and its text as reported must be made available on the website.  Authorizes a Delegate or Resident Commissioner to serve as chair of the Committee of the Whole. (Sec. 3) Reinstates the Holman Rule (allowing amendments to appropriations legislation that would reduce the salary of or eliminate specific federal employees, or cut a specific program), for the first session of the 115th Congress. Requires any reference in clause 2 of Rule XXI to a provision or amendment that retrenches expenditures by a reduction of amounts of money covered by the bill to be construed as applying to any provision or amendment (offered after the bill has been read for amendment) that retrenches expenditures by:   the reduction of amounts of money in the bill,  the reduction of the number and salary of U.S. officers, or  the reduction of any person's compensation paid out of the Treasury.  Continues as inapplicable in the 115th Congress certain requirements of title XVIII (Medicare) of the Social Security Act for congressional consideration of proposals submitted by the President from the Independent Payment Advisory Board, or by the board itself, to reduce the per capita rate of the growth in Medicare spending. Continues from the 112th, 113th, and 114th Congresses certain similar budget-related separate orders, including orders concerning spending reduction amendments in appropriations bills. Requires for memorials presented to the Clerk purporting to be an application of a state legislature calling for a convention for proposing amendments to the Constitution, or a rescission of any such prior application:   the chair of the Committee on the Judiciary, for a memorial presented in the 114th Congress or the 115th Congress, and may, for a memorial presented before the 114th Congress, designate it for public availability by the Clerk; and  the Clerk to make such designated memorials publicly available in electronic form, organized by state of origin and year of receipt, and shall indicate whether it was designated as an application or a rescission.  Makes it out of order to entertain a motion that the Committee of the Whole rise and report a bill to the House if the bill, as amended, exceeds an applicable committee allocation of new budget authority. Prohibits advance appropriations unless: (1) the appropriation is provided for an account identified as an exception in the list submitted for printing in the Congressional Record by the chair of the Committee on the Budget (when elected), and (2) total advance appropriations do not exceed a specified amount. (Under this resolution, an advance appropriation is any new discretionary budget authority provided in appropriations legislation for FY2017 or amendment or conference report that first becomes available for FY2018). Requires the Congressional Budget Office to prepare an estimate of whether legislation reported by a committee (other than the Committee on Appropriations), or amendment or conference report would cause, relative to current law, a net increase in direct spending in excess of $5 billion in any of the four consecutive 10-fiscal year periods beginning with the first fiscal year that is 10 fiscal years after the current fiscal year. Makes it out of order to consider legislation that would cause such net increase. Exempts legislation from this requirement:  repealing or reforming the Patient Protection and Affordable Care Act and the Health Care and Education Affordability Reconciliation Act of 2010, or for which the chair of the Committee on the Budget has made an adjustment to the allocation, levels, or limits contained in the most recently adopted concurrent budget resolution.  Requires a committee report on legislation to include a list of directed rule making required by the measure or a statement that the proposition contains no directed rule makings. Prohibits lobbyists who are former Members, former House officers, or spouses from using the Members's exercise facilities. Reserves H.R.1 through H.R. 10 for assignment by the Speaker and H.R. 11 through H.R. 20 for assignment by the Minority Leader. Requires measures proposing to repeal or amend any law that is not contained in a codified title of the U.S. Code to include, in parentheses immediately following the designation of the proposed matter, the applicable U.S. Code citation, or, if no such citation is available, an appropriate alternative citation to the applicable law or part. Requires the Committee on House Administration, the Clerk, and other House officers and officials to continue efforts to broaden the availability of legislative documents in machine readable formats. Authorizes a Member and an eligible Congressional Member Organization to enter into an agreement under which:   a Member's employee may carry out the Member's official and representational duties by assignment to the organization; and the Member shall transfer the portion of his or her Members' Representation Allowance that would otherwise be used for such an employee's salary and related expenses to a dedicated House account administered by the organization.  Directs the Committee on House Administration to promulgate related regulations. Makes it out of order to consider any measure that reduces the actuarial balance by at least .01% of the present value of future taxable payroll of the Federal Old-Age and Survivors Insurance (OASI) Trust Fund for a specified 75-year period. Exempts from this prohibition, however, any measure that would improve the actuarial balance of the combined balance in the OASI Trust Fund and the Federal Disability Insurance Trust Fund for the same 75-year period. Prohibits provisions in a bill, joint resolution, amendment, or conference report requiring or authorizing a conveyance of federal land to a state, local government, or tribal entity, from being considered as providing new budget authority, decreasing revenues, increasing mandatory spending, or increasing outlays. (Sec. 4) Reauthorizes:  the House Democracy Partnership (formerly, House Democracy Assistance Commission);  the Tom Lantos Human Rights Commission; and  the Office of Congressional Ethics (treating it as a standing committee for purposes of hiring consultants).  Continues: (1) the exemption of the Office's board from the term limit requirement allowing a member of its board to serve only for four consecutive Congresses, and (2) the authorization for four specified individuals appointed to the board in the 110th Congress to be reappointed for a third additional term. Requires any individual subject to a preliminary review or second-phase review by the Office's board to be informed of the right to be represented by counsel. Prohibits the invoking of this right to be held negatively against them. Bars the Office from taking any action that would deny any person any right or protection under the Constitution. (Sec. 5) Authorizes the Speaker to recognize a Member for the reading of the Constitution on any legislative day through January 13, 2017. Sets forth the rule for consideration of H.R. 21 (Midnight Rules Relief Act of 2017).",
         "summary_short": "(This measure has not been amended since it was introduced. The summary has been expanded because action occurred on the measure.) Adopts the Rules of the House of Representatives for the 114th Congress as the Rules for the 115th Congress, with amendments. (Sec. 2) Directs the Sergeant-at-Arms to impose a fine against a Member, Delegate, or Resident Commissioner for use of an electronic device for still photography or for audio or visual recording or broadcasting in contravention of clause 5 ...",
         "versions":[
],
         "actions":[
         {
           "id": 11,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "Motion to reconsider laid on the table Agreed to without objection."
         },
                  {
           "id": 10,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "On agreeing to the resolution Agreed to by the Yeas and Nays: 234 - 193 (Roll no. 6). (text: CR H7-11)"
         },
                  {
           "id": 9,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "On motion to commit with instructions Failed by the Yeas and Nays: 193 - 236 (Roll no. 5)."
         },
                  {
           "id": 8,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "Mr. Lewis (GA) moved that the resolution be committed to a select committee composed of the Majority Leader and the Minority Leader with instructions to report it forthwith back to the House with an amendment to strike subsection (a) of Section 2."
         },
                  {
           "id": 7,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "On ordering the previous question Agreed to by the Yeas and Nays: 237 - 193 (Roll no. 4). (consideration: CR H26)"
         },
                  {
           "id": 6,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "DEBATE - The House resumed debate on H. Res. 5."
         },
                  {
           "id": 5,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "DEBATE - The House proceeded with one hour of debate on H. Res. 5."
         },
                  {
           "id": 4,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "On motion to table the motion to refer Agreed to by the Yeas and Nays: 228 - 184 (Roll no. 3)."
         },
                  {
           "id": 3,
           "chamber": "House",
           "action_type": "ResolvingDifferences",
           "datetime": "2017-01-03",
           "description": "Mr. McCarthy moved to table the motion to refer"
         },
                  {
           "id": 2,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "Ms. Norton moved to refer the resolution to a select committee of five members, to be appointed by the Speaker, not more than three of whom shall be from the same political party, with instructions not to report back the same until it has conducted a full and complete study of, and made a determination on, whether there is any reason to deny Delegates voting right in the Committee of the Whole House on the state of the Union."
         },
                  {
           "id": 1,
           "chamber": "House",
           "action_type": "Floor",
           "datetime": "2017-01-03",
           "description": "Considered as privileged matter. (consideration: CR H7-28)"
         }
         ],
         "votes": [
           {
             "chamber": "House",
             "date": "2017-01-03",
             "time": "17:34:00",
             "roll_call": "6",
             "question": "On Agreeing to the Resolution",
             "result": "Passed",
             "total_yes": 234,
             "total_no": 193,
             "total_not_voting": 6,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/6.json"
           },
           {
             "chamber": "House",
             "date": "2017-01-03",
             "time": "17:16:00",
             "roll_call": "5",
             "question": "Motion to Commit",
             "result": "Failed",
             "total_yes": 193,
             "total_no": 236,
             "total_not_voting": 4,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/5.json"
           },
           {
             "chamber": "House",
             "date": "2017-01-03",
             "time": "16:58:00",
             "roll_call": "4",
             "question": "On Ordering the Previous Question",
             "result": "Passed",
             "total_yes": 237,
             "total_no": 193,
             "total_not_voting": 3,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/4.json"
           },
           {
             "chamber": "House",
             "date": "2017-01-03",
             "time": "15:04:00",
             "roll_call": "3",
             "question": "Table Motion to Refer",
             "result": "Passed",
             "total_yes": 228,
             "total_no": 184,
             "total_not_voting": 21,
             "api_url": "https://api.propublica.org/congress/v1/115/house/sessions/1/votes/3.json"
           }
         ]

      }
   ]
}
